{
    "numeric": {
        "7 Early, 8 Early (七早八早)": "(Phrase) “7 Early, 8 Early” (七早八早) also common in its hokkien form is used to refer to the time frame between 7am – 8am (or earlier) when some could still be asleep. It is commonly used as a phrase that precedes a complaint of an activity that caused a din disturbing some people who could still be asleep.. Here is a simulated conversation. Ah lian: “Eh hello today Sunday leh….basket I wanna get my beauty sleep lah .. why you 7 early, 8 early bing bing pong pong huh?? sibeh noisy leh……\n Ah Hua: “Paiseh lah…I meeting my ang moh boyfriend to go jogging mah….I wanna put makeup first hahah… Ah lian: “Jogging put makeup?? Why don’t you eat and shit at the same time?!?”",
        "5Cs": "(Acronym) 5Cs other than representing the 5 goals of most Singaporeans, it is also the criteria that some females would expect from their future husbands.. Here is a simulated conversation. Cash, Credit Card, Condominium, Car and Country Club Membership are the must haves for some Singaporeans.  Ah Seng: “Ah Huay…now of the 5Cs hor, I only have 2 leh….just a bit of Cash and a Credit Card leh…..will you still be with me till I mati??? Ah Huay: “It’s ok lah, I understand….no condominium then HDB ok lor, no car we take public transport lor….no country club membership….we can go community centre lor Ah Seng: “I am so touched…..” *Sob… Ah Huay: “But…..as long as we are not married and one day if someone who can provide me all these 5Cs and makes me happy suddenly turn up, then don’t blame me hor…………..” Ah Seng: “…………………….”",
        "4D": "(Acronym) 4D is a 4 digit lottery game in Singapore which is run by Singapore Pools.. Here is a simulated conversation. Draws take place on Wednesday, Saturday and Sunday.\n Ah Beng: “Ah Lian, if I struck 4D this weekend, I will treat you to eat in an atas restaurant!!",
        "13th Month": "(Noun) 13th Month is a term used to refer to the 13th month bonus which is also known as the Annual Wage Supplement (AWS) that “most” companies in Singapore give out to permanent staff. This is also known as year-end bonus.. Here is a simulated conversation. Ah Lian: “Ah Hua what do you intend to spend on with your 13th Month bonus??? Ah Hua: “Auntie ah, I work as housewife leh, simi 13th Month bonus?? Ah Lian: “Your hubby is your towkay mah, you tell him no money no honey, gimme my money.”",
        "7th Month": "(Noun) This is a festival observed by Singaporean Chinese. The belief is that spirits will emerge when the gates of the netherworld are opened during this period. The Chinese in Singapore will partake in a series of events which include burning of offerings (incense, joss paper, hell notes, paper house, paper car, necessities, etc) for their departed relatives.. Here is a simulated conversation. Some will participate/attend night performances in the form of “Getai” where songs and opera will be performed for both the dead and living. The front row will be kept empty as it is meant for the dead.  Ah Beng: “John!!! Be careful!! Don’t step on the offerings on the floor! Now 7th Month!!! John: “Alamak!! Sorry sorry I didn’t mean to step on your offerings, sorry sorry. Let me cross, let me cross… (借过。。借过。。) Ah Beng: “Wait a minute, John, aren’t you a Christian?? How come you also believe in this?? John: “I am a Chinese after all and it is also a form of respect to other beliefs; and of course it is better to be safe than sorry….”",
        "10KKJ": "(How it came about) 10KKJ\n. Here is a simulated conversation. 10KKJ is an internet slang that is used to represent Tampines, a town situated in the eastern region of Singapore. It is not commonly used in conversation but frequently used in online forums, text messages and is usually communicated between males. 10KKJ > 10 Ku Ku Jiao > Ten Penis > Tampines Ku Ku Jiao is the hokkien word for penis, so 10KKJ in english is literally “Ten-Penis” which phonetically sounds like Tampines.",
        "11B – Military Identification Card": " 11B is a green Military Identification card issued to Full-Time National Servicemen in Singapore. Compulsory military service is required for every able-bodied Singaporean male aged 18 and above.. Here is a simulated conversation. Upon enlistment, they will surrender their NRIC (National Registration Identity Card) and be issued with the 11B Military Identification card (green) for their stint in National Service. Commonly associated with: ORD, ROD, MR, NRIC, Pink IC  "
    },
    "a": {
        "Atas": "(Example) Atas can be used to describe someone as being arrogant or snobbish but is more commonly used now to describe someone doing things that is high class and of good taste.. Here is a simulated conversation.  Muthu: Wah Ah Beng and Ahmad, I saw you guys dining at some atas restaurant on your instagram feed……basket bo jio….won 4D is it??",
        "Abang": "(Noun) Abang is a malay term for elder brother or just simply brother. It is common to call a male malay friend “abang” as it is akin to calling him “Hi Bro”.. Here is a simulated conversation. Ah Beng: “Yo Abang! Long time never lepak with you already. Let’s find one day to talk cock sing song at your place alright???“\n",
        "Ah Huay": "(Noun) . Here is a simulated conversation. Like Ah Seng who is Ah Beng‘s sidekick, Ah Huay (female) is Ah Lian‘s sidekick. The same stereotypical perception of her as a young punk/hooligan who is materialistic and not so good in her studies; just like her three other friends. These four names are used simply because they are common Chinese names in Singapore. Ah Lian:”Ah Hua, you are my best friend so we must have the same hair dye colour okay??? Let’s do shocking pink this time round!!\n Ah Beng, Ah Seng, Ah Lian",
        "Ah Lian": "(Noun) . Here is a simulated conversation. Like Ah Beng, Ah Lian is the female equivalent who is stereotyped as a young punk/hooligan who is materialistic and not so good in her studies. She often hangs out with her good friends Ah Beng, Ah Seng and Ah Huay. These four names are used simply because they are common Chinese names in Singapore. Ah Beng:”Eh Ah Lian, I think we are the most compatible couple in our school, our style both sama sama and we both look so intimidating. Come, be my stead lah.”\n Ah Beng, Ah Seng, Ah Huay […] who is materialistic and not good in his studies. He often hangs out with his good friends Ah Beng, Ah Lian and Ah […]",
        "Ah Seng": "(Noun) . Here is a simulated conversation. Like Ah Beng, Ah Seng (his sidekick) is also someone who has been stereotyped as a young punk/hooligan who is materialistic and not good in his studies. He often hangs out with his good friends Ah Beng, Ah Lian and Ah Huay. These four names are used simply because they are common Chinese names in Singapore. John:“Daddy, the Ah Beng and Ah Seng in my school bullied me during recess time and demanded for my pocket money…” Ah Beng, Ah Lian, Ah Huay […] Ah Seng who is Ah Beng‘s sidekick, Ah Huay (female) is Ah Lian‘s sidekick. The […] […] is materialistic and not so good in her studies. She often hangs out with her good friends Ah Beng, Ah Seng and Ah […] […] Beng is commonly associated with his “friends” Ah Seng, Ah Lian and Ah Huay and they are often used together to describe a group of young […]",
        "agar-agar": "(Noun) agar-agar is a jelly-like dessert derived from algae. It can also be used as an ingredient to complement other desserts.. Here is a simulated conversation. agar-agar itself can also be added with fruit slices or coconut milk to enhance its taste and appearance. Siti: “Ahmad, I made your favourite agar-agar today with peach slices in them.",
        "Alamak": "(Exclamation Word) Alamak is an exclamation word used in situations when you are shocked or surprised by something or an event. It is something akin to “Oh my Mother!” and also “Oh my God!”.. Here is a simulated conversation. Ahmad: “Alamak!! I forgot to feed my cat before I went for Football practice….it must be super famished now” […] “Alamak…you know what happened today?? I woke up late and went to work wearing my blouse inside […]",
        "Ang Moh": "(Noun) Ang Moh is a term that is used to refer to Caucasians. In the past, older people who disliked Caucasians will call them “Ang Moh Gui” (红毛鬼) which literally means “red hair ghost”.. Here is a simulated conversation. Ah Lian: “Ah Hua, you see that cute handsome Ang Moh drinking alone at that corner, let’s go and talk to him lah.”\n […] 1 – Ah Lian: “Just now got one cute and handsome Ang Moh stealing glances at me…aiyo I am so paiseh about […] […] “Ah Beng ah, your english is sibeh  powderful sia. I witnessed your conversation with the ang moh when you were trying to sell her perfume. You used phrases like “a person of your elegance […]",
        "AWARE – Association of Women for Action and Research": "(Example “ONLY”) AWARE is a non-governmental organization in Singapore that is involved in research and advocacy for women and to promote gender equality. . Here is a simulated conversation. It provides women who need help with various support services including legal services, helplines, education and training. Their objectives are mainly to promote the participation and contribution of women to society as well as the well-being of women and gender equality. Ah Beng: “Now those army boys cannot anyhow sing the “Purple Light” song in camp liao”\n Ah Seng: “Why ah??” Ah Beng: “Because AWARE complained about the lyrics lor Ah Lian: “Aiya, can still sing lah just don’t sing those derogatory lyrics lor….. Ah Seng: “simi lyrics??” Ah Beng: “K*** the man! R*** my girlfriend!”\n Ah Lian: “Shaddup lah!!”",
        "Agak, Agak-Agak, Agaration": ") Agak and agak-agak are both malay words and are used to describe to estimate/guess. It is a conjecture usually based on one’s experience or one’s estimation.. Here is a simulated conversation.  Agak-agak can also be used to represent “about” or “more or less”. A singlish form of estimation inspired by agak is spelled as “agaration” Example: Susan: “Eh Siti, how many tablespoons of sugar for making this Pandan Chiffon Cake?”\n Siti: “It is about the same as the marble cake, but you agak for yourself by doing a bit of taste testing lor.\n Susan: “Yes I did. The sweetness is agak-agak the same but I just wanna double confirm with you before baking it.\n Siti: “One must trust their own argaration, only then they will learn and improve mah”"
    },
    "b": {
        "Bao The Mountain, Bao the Sea (Bao Sua Bao Hai,包山包海 )": "(Phrase) “Bao the Mountain , Bao the Sea” (包山包海) is the chinese-english equivalent of the hokkien phrase “Bao Sua Bao Hai”. It literally translates to cover the mountain and cover the sea. It is usually used to describe a person who has to take care of everything/ anything.. Here is a simulated conversation.  Ah Beng in a job interview with a construction firm Ah Beng: “Manager ah, in my current company I am the most versatile person because I can do almost anything. You know I am the type that bao the mountain, bao the sea one lah. So by hiring me I will be the biggest asset you will ever have.\n Hiring Manager: “Oh…so you mean you macam Jack of all trades but master of none lah right?? Ah Beng: “Simi sai? You dare to say again?? Basket, come I challenge you outside talk.” Hiring Manager (feeling threatened): “This interview ends here” Ah Beng: “Boh lah, relax lah, I meant we go outside of your office and let me exhibit my competence and show you mah…haha chillax bro chillax…” Hiring Manager: ………..",
        "BGR – Boy Girl Relationship": "(Acronym) BGR is an acronym for “Boy Girl Relationship”. This is used to describe young couples/teenagers who are in a relationship.. Here is a simulated conversation. Teacher to a friend: “Nowadays, there are many young couples in my school. I am worried that they are too engrossed in their BGR problems than focusing on their studies.\n",
        "Brudder": "(Noun) Brudder is a popular misspell for the word brother and is often used in online forums and messages in chat groups.. Here is a simulated conversation. \nNoun:\n\nAh Seng writes in his army message group: “Yo Brudders!!! Long time no hear from you guys! How is everyone? You guys got buy insurance anot??? Want more coverage? You can look for me man brudder!!\n\nMuthu: “You don’t brudder brudder us lah! I not your brudder!! \n\nAhmad: “Basket when you need help then you bother to message us, brudder your head!!\nShare this:Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Reddit (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Skype (Opens in new window)Click to share on Telegram (Opens in new window)\n\nRelated\n\n Ah Seng writes in his army message group: “Yo Brudders!!! Long time no hear from you guys! How is everyone? You guys got buy insurance anot??? Want more coverage? You can look for me man brudder!!\n Muthu: “You don’t brudder brudder us lah! I not your brudder!! \n Ahmad: “Basket when you need help then you bother to message us, brudder your head!!",
        "Buay Tahan": "(Phrase) Buay (Hokkien) for “cannot” and tahan (malay) for “withstand” combines together to give the expression that one can no longer withstand or tolerate any longer. It has a similar meaning to the malay phrase “tak boleh tahan” where “tak boleh” means cannot.. Here is a simulated conversation. Recruits in a packed toilet just before reveille –\n Ahmad: Eh!!! Who inside cubicle for so long?? I wanna pass motion!! Tak Boleh tahan oredi!! Ah Beng: Ya lah, limpeh wanna pang sai also!! Buay tahan oredi!!! My sai at custom oredi!!",
        "Botak": "(Adjective) Botak is used to describe someone that is bald and is also used to describe a balding person. It is also commonly used to describe someone who has just gotten a crew cut, especially new recruits to the Singapore Army.. Here is a simulated conversation. Commonly paired with “head” to form the phrase “botak head”.\n Muthu: Peter, nowadays weather sibeh hot leh, how sia???\n Peter: Cut botak head lor, will be super cool and shiok.",
        "Blur Like Sotong": "(Phrase) Blur Like Sotong is used to describe a person that is totally clueless to the events happening around him/her.. Here is a simulated conversation.  Ah Lian: Ah huay!! I wanna complain!! Just now, I explained to my son his homework and how it is to be done. After I explained like 10 times, he still blur like sotong, kept doing the sums wrongly over and over again.\n Ah Huay: Of course lah! Your pattern is if you cannot convince, you confuse correct??? If I were your son, I think I will be lagi blur…",
        "Bo Jio": "(Phrase) Bo Jio is commonly used to say someone who had left you out on an outing or action.. Here is a simulated conversation. Ah Beng to his platoon mates: “Eh guys, how come last time you guys bo jio me go eat the buffet steamboat? I saw all the delicious food on you guys instagram feed lor….really is bo jio!!!!!\n Ah Seng: “We did what….. you were quarreling with your girlfriend on the phone and you gestured to us to F-off…..”",
        "Bobo Shooter": "(Noun) Bobo shooter is used to describe someone that is always off target when it comes to firing a weapon. This term is frequently used in the army where soldiers go for their annual shooting (range) where incentives in the form of cash will be given for attaining marksmanship as a team/detail. . Here is a simulated conversation. Ah Beng at an army shooting range: “Wah jialat….our shooting detail got two bobo shooter, we can forget about the cash incentive liao….",
        "BTO – Build-To-Order": "(Example) BTO is an acronym that stands for Build-To-Order and this refers to new public housing/flats in Singapore offered by HDB (Housing Development Board of Singapore). BTO sales typically runs quarterly throughout the year. (depends on demand as well). Here is a simulated conversation. Bob: “Eddie, the HDB you staying in, was it BTO or resale?\n",
        "Borrow Me": "(Phrase) Borrow me is wrongly used as a phrase when asking someone to lend an item. Instead of asking “Can I borrow your book?” or “Can you lend me your book?” , “borrow me” is often wrongly used in day-to-day conversation.. Here is a simulated conversation. “Eh Cindy, can you borrow me your make-up kit? I wanna do some touch up.”\n"
    },
    "c": {
        "Chicken Feed": "(Phrase) Chicken Feed is Singlish’s very own version of the english phrase “a piece of cake”. It is akin to describing that a task is easy or a problem that can be resolved easily.. Here is a simulated conversation. Ahmad: “Yo Muthu!! Yo Ah Beng!!! How was the chemistry exam???!!“\n Muthu: “Aiya I sure get an ‘A’ grade lah, it was chicken feed lor” Ah Beng: “Same same lah it was chicken feed as compared to my complicated chemistry with my girlfriend Ah Lian…sob* sob*….that one not chicken feed…”",
        "Copycat Kiss The Rat, Go Home Let Your Mother Slap": "(Phrase) This phrase was popular back in the 90s when school-going kids often used this phrase to spite someone who always copied their actions or to say someone that had no idea of his/her own and just simply followed the crowd.. Here is a simulated conversation. Ah Lian: “Ah Huay , later recess time go canteen eat simi ah?? I thinking of eating Mee Siam and drink Milo leh”\n Ah Huay: “Hmm..I don’t know leh…think I follow you bah….” Ah Lian: “Huh?! You wanna copy me ah?? So boring lah you..” Ah Huay: “Aiya we are sisters mah…oh yeah I wanna buy the same pencil-case that you are using, where did you get it ah?” Ah Lian: “What?! You serious boh….everything also wanna same same ah. ..You copycat kiss the rat , go home let your mother slap lah…aiyo…..buay tahan",
        "Chao Keng": "(Verb) Chao Keng is a commonly used term when describing someone for feigning illness or injury in order to avoid a duty/responsibility. This term is often used in the Army and at workplaces. It is synonymous to the english word “malinger”.. Here is a simulated conversation. Ah Beng: “Ahmad…how?? I don’t wanna go field camp next weekend…I wanna go meet my girlfriend…to sort out our BGR problems….\n Ahmad: “How? I tell you hor…you better don’t chao keng and keng MC hor….Be a man and don’t sabo us ok???",
        "Cock-Up": "(Noun) Cock-Up is frequently used to described a situation where something bad or unpleasant has occurred and prevent rightful things from happening or causing something bad to happen. E.g. a cock-up that leads to something that was supposed to happen not happening to a cock-up that leads to something bad/unpleasant happening.. Here is a simulated conversation. Officer to his men during an army training: “Gentlemen, there has been a cock-up in regard to our lunch ration. We originally indented 90 pax of ration but only 30 were delivered. We are now making arrangements for combat ration as replacements….very sorry for not giving you guys a hot meal…\n",
        "Chi-Ba-Boom": "(Sound) Chi-Ba-Boom is often used to mimic the sound of an explosion or describe an explosion; often in a comical way.. Here is a simulated conversation. Ah Beng and Ah Seng at a live show: “Wa liao eh Ah Seng, you missed the climax man!! The Escape Artist managed to escape the warehouse before the whole thing chi-ba-boom you know…..wa liao of all times you must go and pee at the most exciting segment….aiyo…wasted lah..\n",
        "Calefare": "(Noun) Calefare is someone that takes on a minor role in a film industry. They are usually an extra in a movie or show setting.. Here is a simulated conversation. They could be acting as someone in a crowd, patrons of a restaurant, commuters in a train, etc. Someone that is insignificant but essential to create a realistic scene to mimic day-to-day life.  Cynthia: Eh Jacob, I heard you are working as a calefare on a film set. Does the company pay you well?\n Jacob: Well, not really. Pretty long hours and pay is okay only…but I like the exposure….who knows I can be a star one day??? Cynthia: Erm…..you tan ku ku also won’t happen lor…",
        "Chin Chai": "(Exclamation) Chin Chai is often used as a reply to a question when one is unable to make up his/her mind or has no preference to a choice. It can also be used to describe a person that is easy-going.. Here is a simulated conversation. Ah Lian: Eh Kavita, what drink do you want?? Got coke, barley , chrysanthemum, etc?\n Kavita: chin chai lah, not too sweet and non-gassy can already! Ah Lian: Basket…like that you call chin chai?? You go drink tap water better.",
        "chao private": "(Verb) Chao Private refers to a newly enlisted soldier. The word “chao” stands for smelly in hokkien and Private is the rank for a newly enlisted Soldier.. Here is a simulated conversation. The words used together form a name that is often used on new recruits by other older soldiers; who are of higher rank and is usually an instructor. “Chao Recruit” is often used as well.  Army Sergeant talking to new recruits: Eh why never greet me huh? You chao privates treat me as invisible is it?? Whole lot drop 20!! (corporal punishment of 20 push-ups).\n",
        "Corlick": "(Noun) Corlick is often used in internet forums as a misspell for the word colleague as it is phonetically similar.. Here is a simulated conversation. Xiao Ming writes in an online forum: “Today I jio my sexy corlick out for makan at 10kkj…she said yes!\n",
        "Chope": "(Verb) Chope is commonly used in scenarios where one has to reserve a table or seat at a place usually a hawker centre or eatery with no fixed seating. This usually happens when there is a large crowd at a hawker centre during the peak dining periods.. Here is a simulated conversation. As patrons have to queue for food (self service), some will use tissue paper packs to “chope” the table or seats in advance. Siti to Ah Lian: Ah Lian, later we go hawker centre to makan, remember to bring tissue pack to chope table.\n Ah Lian: Ok, but hor nowadays so many people complain about chope-ing with some just claiming the tissue pack is theirs lor. I think I bring toilet roll put my name “Ah Lian” big big to chope better! She who dares win!!"
    },
    "d": {
        "Du lan": "(Adjective) Du lan is a very common hokkien expletive that is used to express that one is pissed off with something.. Here is a simulated conversation.  Ah Beng: “Basket!! That yaya papaya friend of your every time wanna flaunt his wealth in front of my girlfriend……I sibei dulan him!!!\n",
        "Drop 20": "(Army Lingo) Drop 20 is an army lingo that is used by instructors to give recruits or trainees a corporal punishment of 20 push ups.. Here is a simulated conversation. This punishment is usually meted out if the soldiers failed to follow instructions or did not perform the task to the expectation of the instructor.\n Sergeant Lee: “Recruits!! see that tree over there?? Run over there, touch it, shout I wanna book out and come back to me within 30 secs! Go!\n After more than 30 secs, Sergeant Lee: “Recruits! You took more than 30 secs!! What is this?!? Whole lot drop 20!!",
        "Die Die Must Have": "(Phrase) The phrase Die Die Must Have is used in scenarios where it is absolutely necessary to have an item or a requirement.. Here is a simulated conversation. Peter:  Hi Software Team, I really need your help to improve our software by adding this important feature. It is a Die Die Must Have feature before our client signs at the dotted line.\n",
        "Die Die Must Buy": "(Phrase) Die Die Must Buy is a phrase commonly used when a Singaporean spots an absolute bargain or when they travel overseas and realize that goods being sold are much more cheaper than in Singapore.. Here is a simulated conversation. Ah Lian: Wa liao!! This handbag costs double the price in Singapore leh…..I die die must buy!!\n",
        "DB – Detention Barracks": "(Noun) DB acronym for Detention Barracks is a well-known term among Singaporean males who serve or had served National Service.. Here is a simulated conversation. Detention Barracks as the name suggest is a military prison where military/national service personnels are imprisoned for military offences. The acronym DB is often used in Singapore Military culture as a form of deterrence for would-be offenders. It is also often used to remind soldiers that any wrongdoing or negligence would lead to a formal charge and result in the offender being sentenced to the DB. Example: “Officer to enlistees: Gentlemen, let me remind you to fulfill your national service obligations. Be extra vigilant in exercising your duties, follow instructions accordingly and follow the chain of command. Any enlistee found to have flawed the rules is liable to a charge which could lead to a stay in DB.\n Example: “Ah Beng had an altercation with his Platoon Sergeant and punched him right in the face. As a result, he was sentenced to two weeks in DB.\n Army, NS"
    },
    "e": {
        "Eeyur": "(Sound) Eeyur (eeee…..yurrrrr…) is a sound that one will produce to express that you are disgusted by something that could be gross, dirty or disgusting.. Here is a simulated conversation. Ah Lian: Ah Huay, you know hor me and my ang moh boy friend went Bangkok last week…I did something unthinkable..\n Ah Huay: Huh? Like what?? Ah Lian: To prove that I am adventurous, I ate those fried insects sold by the street hawkers…\n Ah Huay: Eeyur………..That is so gross and disgusting…..both you and what you eat………….Need to prove you are adventurous until like that meh??? So fake!!",
        "Eye Power": "(Phrase) Eye Power is a phrase frequently used on someone who does not help but just simply stares as though he/she is rendering help through the power of his/her eyes.. Here is a simulated conversation. “Eh Ah Seng, basket lah you…everyone is doing their part by picking up the rubbish and you just stand there and “eye power” ah…You think you Supervisor is it??\n",
        "Eat Snake": "(Adjective) Eat snake is a phrase used to describe a person’s attitude towards work or tasks. It practically means skiving at work and slacking off from tasks and responsibilities.. Here is a simulated conversation. Example: “While everyone is hard at work, Ah Seng always “eat snake”. He always take his own sweet time in the toilet and keep surfing the internet during working hours.\n Example: “Why do you look so stressed? Work is not everything, learn to “eat snake” a bit lah.\n"
    },
    "f": {
        "Fly Me Aeroplane": "(Phrase) Fly me aeroplane, fly aeroplane, fly kite are phrases used when someone back out of a promise or a meet-up.. Here is a simulated conversation. Ahmad: Eh Muthu, you on ah for this Saturday kickabout? \n Muthu: “Sure, I on! Ahmad: Ok thanks, you better don’t fly me aeroplane on that day like last time hor…",
        "Fandi Ahmad": "(Noun) Fandi Ahmad born in 1962 is a retired Singaporean Footballer who plied his trade mainly in the South-East Asia region between late 1970s – 1990s . He also featured for FC Groningen of Netherlands in 1983, famously scoring a goal against Walter Zenga in a UEFA Cup tie against Inter-Milan.. Here is a simulated conversation.  Known as Singapore’s favourite footballing son, Fandi’s most famous accolade while playing for Singapore was in 1994 winning both the Malaysia League Champions and Malaysia Cup. The latter victory was forever etched in the memories of many Singaporeans. Fandi Ahmad’s line in the 1993 Dream Team Song: “Fandi is my name and Soccer is my game!\n"
    },
    "g": {
        "Goondu": "(Noun) Goondu is a name that you use on someone who is either stupid or someone that acts like an idiot. . Here is a simulated conversation. Ah Lian (sobbing*): “Ah Beng!! My friend saw you hugging a gal yesterday at one neighbouring secondary school!!! Why!! Why must you do this to me with a younger gal?!”\n Ah Beng: “Eh you goondu, she is my younger sister lah. It was her “O’ levels results day and she did well lah…” Ah Lian: “Huh really, you never told me you had a sister what!! Ah Beng: “You didn’t ask what….everything must tell you one is it??!!”",
        "GG – Good Game": "(Acronym) GG is often used to tell one another at the end of the game or match that it was a good game. However, it is also used to describe a situation that spells trouble to oneself or an individual. It is almost like signaling the end of that individual.. Here is a simulated conversation. Ahmad at a football training: “Oh no, Ah Beng has not turned up for training yet. Ah Seng, will he be late or what?\n Ah Seng: “He messaged me and said he will be super late…..later coach sure throw a fit again… Ahmad: GG to Ah Beng then….",
        "Grandfather’s Road": "(Phrase) Your Grandfather’s road – is used to tell off people when they block the way of others on a public road/place.. Here is a simulated conversation. My Grandfather’s Road – is used to tell people that their grandfather literally own this road. Ah Beng to a well-dressed guy: Eh Champion, can don’t block limpeh from walking this path anot? You think this is Your Grandfather’s Road??\n Well-dressed Guy: Apologies, we are having a celebration to commemorate the memory of my grandfather. This road is named after him and thus it is indeed My Grandfather’s Road. Ah Beng: Paisei Paisei….",
        "Gao Gao": "(Adjective) Gao Gao are two words with the same meaning of thick and when used together represents it as extra thick or concentrated depending on what the usage is for.. Here is a simulated conversation. Xiao Ming: Uncle, give me a cup of  Kopi Gao (Thick Coffee).\n Coffee Uncle: What happened? You look super sleepy. Going to work ah? Xiao Ming: Ya lor need to go work…last night watch World Cup Football until 4am.\n Coffee Uncle: Ok, Uncle give you gao gao one, confirm you can stay super awake later at work.",
        "Garang": "(Adjective) Garang means fierce or when used in army lingo literally means gung-ho. . Here is a simulated conversation. While on a military exercise: “Eh Ah Beng, can don’t be so garang??? We already walked 20km and still have another 20km to go….can we rest up a bit before we set off again?? \n",
        "Gostan": "(Verb) Gostan is used in scenarios where you need someone to go reverse/backwards. This usually happens in driving situations when you overshot at a destination or turn.. Here is a simulated conversation. Mary: “Oh John, we just missed our turn…can you gostan and turn in again?\n John: “Cannot lah, you think your grandfather’s road ah? We have to abide by the traffic rules!! \nShare this:Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Reddit (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Skype (Opens in new window)Click to share on Telegram (Opens in new window)\n\nRelated\n\n",
        "Gila": "(Noun) Gila is used to describe a crazy person or the state of mind of a person that has gone insane.. Here is a simulated conversation. “Look at that gila! He keeps tying and untying his shoes laces.” “If you did not come to my rescue earlier, I would have gone gila and done the unthinkable.”"
    },
    "h": {
        "Han Plang": "(Noun) Han Plang is used to describe putting everything together or just simply everything.. Here is a simulated conversation. Ah Beng and Ah Lian are packing items for moving into their new house Ah Beng: “Eh hello, you pack finished already?? Why keep putting things here and there one?\n Ah Lian: “Because I like to pack properly, label item by item.. I OCD can??? Ah Beng: “Siao Zha Bor, chin cai pack lah… han plang all together and go lah……buay tahan you..",
        "Ho Seh Boh??": "(Phrase) A popular hokkien greeting when you chance upon a friend outside. It is a simple and yet effective greeting that asks the person how has he/she been.. Here is a simulated conversation. Ah Beng was doing his marketing at the wet market when he saw Ahmad his childhood friend. Ah Beng:  Yo yo Ahmad! Ho Seh Boh???!!!!\n Ahmad: Yo Beng ah!! I no good lah…sibeh sian…I didn’t get into the National Football Team for the SEA games…..sad…",
        "Horrigible": "(Adjective) Horrigible is sometimes used to describe both a horrible and incorrigible person.. Here is a simulated conversation. Ah Huay to Ah Lian: How Ah Lian??? What should I do?? My hubby sibei horrigible!! He refused to come home after work and never gave me any allowance despite promising me to leave that vixen!!! I buay tahan already….should I go for divorce???\n",
        "Hao Lian": "(Noun) Hao Lian is used to describe a person as boastful or a show-off. A Hao Lian is a kind of person that likes to flaunt his/her wealth or success to friends and relatives.. Here is a simulated conversation. Ah Lian: “That Helen really think she is very beautiful and high class. She put heavy make-up, wear gold accessories lah and carry expensive bag…..sibei hao lian…really buay tahan her!!",
        "Hor Jiak Hor Koon": "(Phrase) Hor Jiak Hor Koon is a hokkien term to describe someone having a good life with no worries.. Here is a simulated conversation. Ah Beng: “Wah Veronica, you look so radiant leh and you machiam put on weight…how come? Tai Tai’s life very hor jia hor koon ah???\n",
        "Hokkien Peng – Hokkien Soldier": "(Noun) “Hokkien Peng” refers to hokkien speaking soldiers of the early Singapore Army. This term usually refers to soldiers in the past when most spoke hokkien instead of english due to a lack of education. . Here is a simulated conversation. “My uncle was an officer leading the hokkien peng in the late 1970s. He told me that even though his men did not have much of an education; they were good soldiers. They were always on the ball and chiong sua in a garang manner”\n",
        "Heng": "(Adjective) Heng is used to express some event that you are lucky or fortunate to encounter or to avoid.. Here is a simulated conversation. Lucky/fortunate encounter: “Today I bought $1 4D lottery and I was sibei heng to win the Top Prize!! Lucky/fortunate avoidance: “I initially wanted to buy 10 lots of Laoya International shares but decided not to…..and the stock price dropped by 50% at closing…I was damn heng man.\n",
        "HDB – Housing Development Board": "(Noun) The Housing Development Board of Singapore is the statutory body that is in charge of public housing in Singapore.. Here is a simulated conversation. The vast majority of Singaporeans stay in HDB flats. So, when a Singaporean says he/she stays in an HDB, it simply means he/she is staying in public housing. HDB is very often used as a lame way for marriage proposal (perceived by Singaporean females) as one of the criteria in applying for a new BTO (Build-To-Order) or resale HDB flat is through the Fiancé/Fiancée Scheme. Male: “Eh dear ah, we have come so far in our relationship, it is time to apply for HDB. Ok??\n Female: “What!?!? Is this a proposal??? Where are the flowers and diamond ring??? You are not even on one knee!! How can your proposal be so lame!! It has to be memorable and romantic!!!  @!##$@%$$@#^%$#^ BTO (Built-To-Order) […] that stands for Build-To-Order and this refers to new public housing/flats in Singapore offered by HDB (Housing Development Board of Singapore). BTO sales typically runs quarterly throughout the year. […] […] See HDB […]"
    },
    "i": {
        "ICT – In-Camp Training": "(Noun) ICT stands for In-Camp Training for active Singaporean National Servicemen. It is usually a once or twice a year event to refresh the skills of active National Servicemen as well as getting them up to date with defence news,etc.. Here is a simulated conversation. Ah Seng: “Man, I can’t wait for next week ICT! Can see all my old buddies to talk cock sing song!\n See Reservist […] “Today I furnished my SAF100 to my Boss and HR for my ICT.” […]"
    },
    "j": {
        "Jiak": "(Verb) Jiak is a commonly used word to ask people if they have already eaten or to invite them to eat. It can be used to greet one another at the dinner table urging them to start eating. Younger family members will also greet their seniors at the dining table.. Here is a simulated conversation. This is similar to the malay word “makan“  Pamela the youngest at the family dining table.: “Ah Ma, jiak! Ah Kong, jiak! Mummy-Daddy, jiak! Everybody jiak!!”\n Everyone at the table: “Jiak Jiak Jiak!”",
        "Jialat": "(Adjective) Jialat is being used to describe a dire situation or to describe a person in a bad way.. Here is a simulated conversation. Example: “Oh shit, I forgot to pay my credit card bills, this time jialat already…confirm need to pay interest.” Example: “You know what, your colleague very jialat. I instructed him to do A, he go and do B. He cannot even understand  a simple instruction.”  "
    },
    "k": {
        "Karung Guni": "(Noun) Karung Guni better known to Singaporeans as Karung Guni Man is our local Rag-And-Bone Man who collects old items like newspaper, electrical appliances, clothes and many other stuff.. Here is a simulated conversation. In the past, they will go around with their gunny sack to collect items thus the name Karung Guni is synonymous to this trade. Till this day, they are still active. They will go to every level of HDB flats with their horn and trolley shouting “Karung Guni, buay bor zua gu sa kor, ray-dio-dian-si-kee” (literally means “The Rag-And-Bone Man is here to buy your old newspapers, clothes, radio and television”) repeatedly with every blast of their horn to inform residents of their arrival. Residents often look forward to the Karung Guni Man as they get to sell their unwanted items for a small amount of cash. Ah Beng at his own housing estate: “Karung Guni, buay bor zua gu sa kor, ray-dio-dian-si-kee”“\n Ah Seng: “Wah Ah Beng since when you became a Karung Guni man??!!?? Ah Beng: “Haha , surprised right??!! I am now into recycling of old stuff and at the same time trying to up-cycle and sell whatever old items that I can improve and improvise on. I love our Mother Earth!!  Ah Seng: “……………..”",
        "KPKB – Kao Peh Kao Bu": "(Acronym/Phrase) This hokkien phrase is used to describe someone who cry/bawl when their father/mother passed away. However, it is used popularly to describe someone who makes a lot of noise (usually making a complaint). This is especially true when vulgarities are included in the person’s complaint.. Here is a simulated conversation. At a local stockbroking firm: Alan (just back from his GP visit ): John ah, this time jialat already lah….I was sick yesterday and forgot to help Mdm Tan buy her DEF shares…..this morning I checked….it has gone up….siao liao…..She sure Kao Peh Kao Bu me if she finds out….\n John: Aiyo, why you so careless sia….but you lucky lah the stock market also KPKB now also. The DEF shares has gone back to yesterday’s pricing. Alan: Oh really?? Wah sibeh heng!! Btw…what’s your version of the stock market also KPKB??\n John: Oh….I meant to say the stock market “kao bear kao bull”…..means both bull and bear crying lah…..market is sideways/even now…..no obvious winner or loser………..that’s what I meant. Alan: Haha, cry the bear and cry the bull….that’s a good one! Sounds phonetically the same too!!",
        "Kampong Spirit": "(Noun) The term Kampong / Kampung Spirit is also often used in Singapore’s urban concrete jungle (HDB) where neighbours live in the same estate help one another just like the good old days in the kampong.. Here is a simulated conversation. In older HDB estates, the neighbours could actually be from the same village before they all moved to the HDB flats en masse. Kampong spirit is also used to describe strangers/people coming together to help someone/others when they are in need of help.\n Ah Beng: Ah Seng, did you read the news that day about the person who was trapped under the vehicle? Many people came forward to lift up the vehicle and helped him out and he survived!!  \n Ah Seng: Yeah I did, some people may say we Singaporeans are heartless and only know how to use handphone to take pictures. But in such dire situation, we know how to exhibit our good old kampong spirit to help just about anybody.",
        "Kilat": "(Adjective) Kilat is a malay word that is often used in the Army. It is used to describe something that is done in such an excellent way and is hard for others to follow.. Here is a simulated conversation. Ah Beng: “Wah Ahmad you polished your boots until so kilat ah!!! Very shiny leh your boots…..basket….. spoil market sia….wait Sergeant wants us to be the same standard how?? Don’t sabo leh….\n",
        "Referee Kayu": "(Noun) Referee Kayu could be often heard when one watches a live football match at a stadium. This often occurs when the referee made an incorrect or odd decision. Referee Kayu could refer to the Referee as being blind or wooden in the sense that they are dumb or stupid.. Here is a simulated conversation. After the Referee gave a penalty to the away team when there was no contact between the players: Home Crowd: “Referee you blind is it!!!! Kelong ah!!! Referee Kayu!!! Referee Kayu!!! Referee Kayu!!!!\n",
        "Kena": "(Verb) Kena is a malay word to describe someone that is on the receiving end of something unpleasant and it can also mean the person is suffering or afflicted from something.. Here is a simulated conversation. It is often paired with the hokkien term “sai” (shit). So, you will hear curses of “kena sai” pretty often amongst your singlish speaking friends. It has a variety of alternative spellings: kana, kenna, genna, etc. Sarah: Fandi was such a great footballer in his prime and was always kena marked by at least two opposing players. Those players also played rough and Fandi will kena bruises and knocks from their robust style of playing. Those players really kena sai!!\n",
        "Kakak": "(Noun) Kakak is the malay word for older sister. It can be used to call an elder female sibling or an older female friend. . Here is a simulated conversation. Ah Lian talking to her neighbour Siti: Eh Kakak, where did you buy that bottle of Sambal Belachan you loaned me that day?? The taste sibeh shiok and sedap when paired with my fried chicken.",
        "Kaki": "(Noun) Kaki is used to describe a close friend or a buddy.. Here is a simulated conversation. “Amongst all my friends, Ahmad  is my best kaki. He never fails to say yes whenever I ask him out for coffee.\n \n",
        "Kan Cheong": "(Adjective) Kan Cheong is used to describe a feeling of nervousness. It can be used with the word spider to describe a person who is always nervous as a “Kan Cheong Spider”. Here is a simulated conversation. Example:“Just now my crush came up and talked to me!!! Boy was I so kan cheong and started to stutter incoherently in my replies to him…\n Example: “Hey Ah Seng, stop pushing and shoving lah. Don’t be a Kan Cheong Spider, there is enough for everyone.\n Spider (Kan Cheong Spider)"
    },
    "l": {
        "Legit": "(Verb) Legit is commonly used by the millennials to refer to something as real and not fake.. Here is a simulated conversation. Ah Lian: “Everyone! Look at my new limited edition watch, sibei beautiful right?!\n Ah Beng: “Looks very fake leh, you bought from pasar malam one is it??  Ah Lian: “No lah!! I went to boutique to buy one hor…..this is legit stuff ok!!! I show you receipt!!",
        "Liddat": "(Phrase) Liddat is a misspell for “Like that” and is usually used as a short form in text messages as well as in online forums.. Here is a simulated conversation. Example: Eh dun liddat lah, dun be angry wif me lah….",
        "Lepak": "(Verb) Lepak is used to describe chilling out, to relax at a place or home by not doing anything. It is a form of enjoyment that is carefree and stress-free.. Here is a simulated conversation. Ahmad: “Eh Ah Beng, tomorrow is my off day…wanna come my house and lepak? \n […] Beng: “Yo Abang! Long time never lepak with you already. Let’s find one day to talk cock sing song at your place […]",
        "Lagi": "(Adverb) Lagi is the Malay word that is used to describe something that is more or greater than usual which can be for the better or for worse.. Here is a simulated conversation. For the better: “I tell you it is a must to eat nasi lemak with sambal chilli as it makes the taste lagi sedap (tasty), the hotness of the chilli is lagi shiok than your normal chilli sauce.\n For the worse: “My Mum was already very angry when she lost her handphone and my Dad still continued to lecture her for her carelessness making the situation lagi worse.\n",
        "Look-See": "(Noun) Look-See is used to express to check or examine and sometimes just simply means to have a look.. Here is a simulated conversation.  May: “Boss, the documentation is on your desk.\n Boss: Ok thanks, I will have a look-see later. Later when you go for lunch, please help me check the exchange rate for Ringgit.\n May: “Ok boss, later I help you look-see.  ",
        "Lobang": "(Commonly used with) Lobang is a malay word and is commonly used to describe an opportunity or a chance. It can be used in its literal description of an opening, gap or a hole.. Here is a simulated conversation. Noun: Example for an opportunity: “Nowadays, the economy is very bad and I am out of a job. Do you have any lobang for me? Example for a gap: “Ahmad dribbles the ball forward and lobang (nutmeg – puts the ball through the legs of an opposing player) the oncoming defender.”\n King (Lobang King), Queen (Lobang Queen)  "
    },
    "m": {
        "MLMLWML – Mai Lai, Mai Lai, Wa Mai Lai": "(Internet Slang) This hokkien phrase is used popularly as an acronym in online forums. It is mainly used in reply to an undesirable suggestion telling people that they really do not want it or to be associated to it.. Here is a simulated conversation. Ah Seng:  Ah Beng, that auntie you served just now seems like very rich leh..why don’t you jio her to become your sugar mummy??\n Ah Beng:  MLMLWML!!! Basket!! You think I duck (gigolo) is it??? I can earn my own keep one ok!!",
        "Grandfather’s Road": "(Phrase) Your Grandfather’s road – is used to tell off people when they block the way of others on a public road/place.. Here is a simulated conversation. My Grandfather’s Road – is used to tell people that their grandfather literally own this road. Ah Beng to a well-dressed guy: Eh Champion, can don’t block limpeh from walking this path anot? You think this is Your Grandfather’s Road??\n Well-dressed Guy: Apologies, we are having a celebration to commemorate the memory of my grandfather. This road is named after him and thus it is indeed My Grandfather’s Road. Ah Beng: Paisei Paisei….",
        "MC – Medical Certificate": "(Abbreviation) MC is always used as an abbreviation for Medical Certificate.. Here is a simulated conversation. Amy (HR Personnel): “Xiao Ming, you were sick last friday right?? Why didn’t you submit your MC for verification??\n",
        "Macam": "(Adjective) Macam is a malay word to describe something that is like or similar or bear resemblance to another thing.. Here is a simulated conversation. \nAdjective:\n\nAhmad: “Wah Xiao Ming!! Today I saw you execute that exquisite free kick in our inter-class match. Your style macam David Beckham sia!!! So stylo!!\n\n\nShare this:Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Reddit (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Skype (Opens in new window)Click to share on Telegram (Opens in new window)\n\nRelated\n\n Ahmad: “Wah Xiao Ming!! Today I saw you execute that exquisite free kick in our inter-class match. Your style macam David Beckham sia!!! So stylo!!\n \nShare this:Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Reddit (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Skype (Opens in new window)Click to share on Telegram (Opens in new window)\n\nRelated\n\n",
        "Makan": "(Verb) Makan is a very commonly used word in Singapore. It is used to ask people if they have eaten or to invite them to eat. It is similar to the hokkien/teochew dialect word “jiak“.. Here is a simulated conversation. Ahmad: Ah Beng, you makan already?  Ah Beng: Thanks Ahmad, I will makan later cos I have a lot of backlog to clear.\n",
        "MR – Mindef Reserve": "(Noun) MR the acronym for Mindef Reserve is a reserve force where Singapore National Servicemen will be posted to after they have completed the their full ORNS (Operationally Ready National Service) cycle.. Here is a simulated conversation. A full ORNS cycle usually comprises of seven high keys and 3 low keys call ups over a period of 10 years (plus minus). Interviewer: “Mr. Lim, may I know as of now, are you still fulfilling your National Service obligations? Mr. Lim: “Well, I would say no as I have already MR. Apologies, I meant to say I have completed my full ORNS cycle and is now placed in Mindef Reserve.\n ORD, ROD, ORNS",
        "Malu": "(Adjective) Malu is used to describe a feeling of embarrassment due to an act by the person himself/herself or by others.. Here is a simulated conversation. Siti: “Alamak…you know what happened today?? I woke up late and went to work wearing my blouse inside out……I didn’t even realise until my colleague told me….so malu….",
        "MINDEF": "(Abbreviation) MINDEF is the short form for the Ministry of Defence. This is a ministry of the Singapore Government that is in charge of national defence. It is the headquarters of the SAF – Singapore Armed Forces.. Here is a simulated conversation. Total Defence is its policy and consists of five pillars namely Military Defence, Civil Defence, Economic Defence, Social Defence and Psychological Defence.  Ah Beng to Ah Seng: “Months before my enlistment into the army, I went down to CMPB to do a MINDEF checkup to determine my PES status……and I got an “A”……basket….I hope they don’t send me to Commando School…”",
        "mum mum": "(Noun) “mum mum” is a baby language to indicate food. This is used by parents, grandparents and caregivers of the baby during feeding time.. Here is a simulated conversation. “Ah boy, are you hungry now? Want to eat mum mum already??"
    },
    "n": {
        "Ngeow": "(Adjective) Ngeow is used to described a person that is stingy and behaves like a scrooge. A person of such personality can also be picky over trivial things and find fault with others.. Here is a simulated conversation.  “This auntie of mine is sibei ngeow, she only gave me a $2 ang bao for my birthday party.  “I seriously don’t know how to satisfy my supervisor, he always comment this and that on my work. How the hell am I going to tolerate this “ngeow chee ngeow lan” person.",
        "NATO – No Action Talk Only": "(Acronym) I often heard this acronym during my stint in the army. NATO is used to describe a person who does not walk his talk.. Here is a simulated conversation. NATO in this case is used as an acronym : “No Action, Talk Only” “That bugger every time says he is best in this and best in that, when it comes to doing the actual thing he either act blur or push someone else to do it. He really is NATO.”\n",
        "NRIC – National Registration Identity Card": " Every Singaporean born and bred in Singapore will be issued an NRIC – National Registration Identity Card when they reach the age of 12 years old. Prior to that, they will have to use their birth certificate as a form of identification.. Here is a simulated conversation. The NRIC has two different colours, the pink is for Singapore Citizens and blue is meant for Singapore Permanent Residents. NRIC is in the format of 9 alphanumeric characters for example: “S7012345A”, the first two numbers are usually indication of the birth year. This will be true for those born after 1968; for those born before 1968, their first two numbers are not relevant to their birth year. For those born in Year 2000 and after, their NRIC no. starts with a “T” instead of the “S” which is meant for those born before the millennium. Commonly associated with: Pink IC, 11B"
    },
    "o": {
        "Oei": "(Sound) Oei or Oui is used when you call out to someone that you know. It is an informal way and some regard it as a being rude especially when you are the one being called out to.. Here is a simulated conversation.    David: Oei!!  Long time no see how have you been?? Amy: Who are you? I dunno you.. David: Oei…..dun like that leh??  Amy: Oei…Oui….I don’t have name is it??? You obviously have forgotten!!!",
        "O$P$ – Owe Money, Pay Money": "(Acronym) The acronym O$P$ is often seen scribbled/sprayed on walls of buildings where the debtor lives. This is a tactic employed by loan sharks who harass debtors who failed to pay up.. Here is a simulated conversation. O$P$ + unit no. of the debtor and sometimes the debtor’s name will be sprayed onto the wall at the void deck or on the walls of the floor where the debtor lives. Sometimes, paint could also be splashed onto the debtor’s or debtor’s neighbours doors as a form of harassment.  Ah Seng: Ah Beng, you owe loan shark money ah….why the O$P$ on your wall???\n Ah Beng: Not me lor, my neighbour owe them money!!! You see the unit no. is not mine…..but we share the same wall lor!!",
        "OTOT – Own Time, Own Target": "(Phrase) OTOT which stands for “Own Time, Own Target” is a phrase first used in Army Camps when conducting shooting practice at a range for the soldiers.. Here is a simulated conversation. Instructions will be given to soldiers in this manner: “Firers watch the front, firers watch the front, target/enemy 400m, own time, own target, carry on”. It is also used in a casual manner when soldiers are being informed that they have free time.  Sergeant briefing his Trainees: “Gentlemen, tonight there is no night training so you guys OTOT, but please book in by 2359hrs.”\n",
        "Old Bird": "(Noun) Old Bird is used to describe someone who has been at a e.g. a workplace or army for years and is considered to be experienced and a person of seniority.. Here is a simulated conversation. Ah Beng: “Eh John ah, how do I settle this issue ah? There don’t seem to be any documentation or guide on how to do this?\n John: “You go and ask Peter, he is the old bird here, so must have dealt with this issue before.”\n",
        "ORD – Operationally Ready Date": "(Acronym) ORD is the date when full-time national servicemen (Singaporean Males) complete their 2 years (previously 2.5 years) compulsory stint in the Singapore Army, Navy, Police or Civil Defence Force.. Here is a simulated conversation. It is commonly known as the date that one can get back their Pink IC which is the NRIC, identity card of Singaporeans. Upon enlisting in military service, enlistees will surrender their NRIC and will be issued with a military identification card known as the “11B”. After their stint, they will return to civil life and thus the return of their “Pink IC”. “After we had signed the necessary forms and gotten back our Pink IC, we walked past the new recruits and proclaimed happily ORD loh!!”\n ROD, MR, 11B, NRIC, Pink IC"
    },
    "p": {
        "Pong Pong": "(Baby Lingo) Pong Pong is a baby lingo that represents the act of taking a bath. . Here is a simulated conversation. Ah Lian speaking to her 2 year old son: “Eh Ah boy, you very sweaty after all this running, wanna go pong pong ?\n",
        "Pasar Malam": "(Noun) Pasar Malam is a common sight in the heartlands estates in Singapore. Not necessarily just restricted to the night, it can be operational during the day; but at night will see its peak.. Here is a simulated conversation. This is like a bazaar/pop-up stalls where one can find street food as well as merchandise to purchase. Pasar Malam is usually not a permanent fixture as it moves across different estates and is unlikely to exceed a month. The appearances of Pasar Malam are very common during school holidays and major festivals.  Xiao Ming to his football kakis:  Eh guys, later after training we go Pasar Malam jalan jalan and eat our favourite junk food??? Steady boh?? Don’t say I bo jio..\n",
        "Powderful": "(Adjective) Powderful is often used as a pun to sarcastically praise someone of his/her qualities.. Here is a simulated conversation. Ah Seng: “Ah Beng ah, your english is sibeh  powderful sia. I witnessed your conversation with the ang moh when you were trying to sell her perfume. You used phrases like “a person of your elegance and class” lah, “befitting your simi status” lah blah blah lah…pui…..",
        "Paiseh": "(Adjective) Paiseh is a commonly used hokkien word to describe one’s embarrassment in a situation.. Here is a simulated conversation. Example 1 – Ah Lian: “Just now got one cute and handsome Ang Moh stealing glances at me…aiyo I am so paiseh about it..\n Example 2 – Ang Moh goes Ah Lian’s house for dinner and Ah Lian’s mother says:  “Eh Mr Handsome Ang Moh, please treat this as your home and eat full full ah, no need feel paiseh one lah hor..",
        "Ponteng": "(Verb) Ponteng is a malay word to describe skipping an event, especially used for truancy in which the malay phrase “ponteng sekolah” means “skipping school”.. Here is a simulated conversation. “Eh Ah Beng, tomorrow I need to ponteng from school….because I want to send my girlfriend off at the airport.”\n"
    },
    "q": {
        "Queenstown (Singapore)": " Queenstown located in the south-western part of Singapore’s central region is the first satellite town in Singapore. It was first developed by Singapore Improvement Trust in the 1950s and thereafter by HDB in the 1960s.. Here is a simulated conversation. The name Queenstown was chosen for the first satellite town to mark the coronation of Queen Elizabeth II in 1952. Notable buildings include Queensway shopping centre which is famous for its sports merchandise. Ikea is also nearby along Alexandra road."
    },
    "r": {
        "Referee Kayu": "(Noun) Referee Kayu could be often heard when one watches a live football match at a stadium. This often occurs when the referee made an incorrect or odd decision. Referee Kayu could refer to the Referee as being blind or wooden in the sense that they are dumb or stupid.. Here is a simulated conversation. After the Referee gave a penalty to the away team when there was no contact between the players: Home Crowd: “Referee you blind is it!!!! Kelong ah!!! Referee Kayu!!! Referee Kayu!!! Referee Kayu!!!!\n",
        "ROM – Registry Of Marriages": "(Example) ROM is the acronym for Registry of Marriages, this is the place where couple tie their knot formally as a civil marriage in Singapore. It can also be used (unromantically) as a proposal question.. Here is a simulated conversation. Unromantic man to Girlfriend: “Dear ah……..do you wanna go ROM and ROM anot ah??\n See HDB",
        "Reservist": "(Noun) Reservist in english refers to a person who is a member of their country’s military reserve force. In Singapore, it is largely used to describe In-Camp Training for Singaporean NSmen.. Here is a simulated conversation. The period can range between days to weeks and are classified either as a low-key or high-key event based on the number of days involved. I just sent my SAF100 (call-up slip) to HR for them to process the necessary for my reservist in November.\n Army, NS […] Beng speaking to HR Admin in his company: “Eh Amy, next month I go chiong sua (Reservist) . Here is my SAF100, please help me to do the claim of my salary for the period that I will be […] […] See Reservist […]"
    },
    "s": {
        "Siang Kar Pager?": "(Phrase) This hokkien phrase was commonly used back in the 80s/90s and early 2000s when there was widespread use of pagers. A pager also known as a beeper is a telecommunication device that can receive alphanumeric messages and its main purpose is to receive alerts when someone is looking for you. Back in those days, the pager owner will return call using a landline or via a public phone booth.. Here is a simulated conversation.  With the introduction of the mobile phone, pager is now mainly used by emergency services personnel. Back in the 90s….. Beep-Beep-Beep!!…..Beep-Beep-Beep!!!…..Beep-Beep-Beep!!!…..Beep-Beep-Beep!!!!!! Ah Beng looks at his motorola pager:  “This number not familiar one leh…dunno who sia….should I waste 10-cent return call anot ah??? Hmm….”\n Ah Beng returns call:  “Eh Hello! Hello?! Eh Siang Kar Pager???” Insurance Agent Willy: “Hi! Tan Ah Beng!!! Ho Seh Boh??? Remember me I am your secondary school friend Willy……I now sell insurance wor….be my customer leh!!” Ah Beng with his usual wayang antics: “Hello….Eh hello!!! I can’t hear you…hello…hello…” (*drops the call)…..”Nabei….waste my 10-cent………shall block this bugger next time….”",
        "Satki": "(Adjective) Satki is used to describe someone that has a fierce aura/look. However, It is popularly used to describe someone that looks cool.. Here is a simulated conversation. It is as though if looks could kill. Ah Huay: “Wah Ah Lian, did you see that customer I served earlier??? He sibeh satki leh!!! So cool man!!\n Ah Lian: “Huh…that kind you call satki ah??? My boyfriend with his tattoos lagi satki okay!?",
        "Sayang": "(Noun/Verb/Adjective) Sayang can be used in various forms. It can be used to tell someone that you love or dote on them, or to call out to someone that is dear to you e.g. husband/wife/children. It is akin to sweetheart or darling.. Here is a simulated conversation. It is also used to describe a missed opportunity describing it as “what a pity” or it will be a pity if action is not taken.\n Ahmad: You know Sayang, we are not young anymore, maybe it is time to get married???\n Siti: Huh?! Is that a proposal??? All these while you never sayang me with any tender loving care lor…. Ahmad: Aiya…ok lah I will treat you better after marriage…..Ok Ok I tell you the truth….Today I received HDB letter, our queue number is 20…..so if we give up this good number will be damn sayang one lor Siti: #$%#@%^$^%#!!!",
        "Sedap": "(Adjective) Sedap is a malay word used to describe food as being tasty, delicious or yummy.. Here is a simulated conversation. Ah Beng to Ahmad’s Mother: Wah Makcik, your sambal goreng very sedap!!! But your Beef Rendang is lagi sedap!!! Best!!\n",
        "shee shee": "(Phrase) The phrase shee shee is usually used on toddlers. It is used to ask the toddlers if they want to urinate.. Here is a simulated conversation. The continuous whistling “shee” sound with a short interval pause is used to urge the toddler to urinate.  Parents to toddler: “Ah boy do you want to shee shee? Come boy, I whistle for you to pass urine ah…sheeeeeee…..sheeeeeeeee“",
        "SBC": "(Noun) SBC is the acronym for Singapore Broadcasting Corporation which was active between 1980-1994 bringing quality drama, documentaries and current affairs programmes to Singapore’s viewers.. Here is a simulated conversation. Ah Lian to Ah Beng: “Last time SBC drama all very nice one, good plot, good actors/actresses, good camera angles some more. Those dramas always tug at my heartstrings one lor. Nowadays, I turn on TV for less than five minutes, I immediately switch off….so boring…”\n",
        "Salah": "(Noun) Salah is the malay word to inform that a person or something is wrong or incorrect.. Here is a simulated conversation. Ah Beng: “Eh Ibrahim, last time our idol Fandi Ahmad used to play for Ajax Amsterdam in Holland right? Ibrahim: Salah lah bro,  he went for a trial with Ajax but refused the contract they offered him. He did eventually play in the Dutch Eredivisie for FC Groningen in 1983.\n",
        "Simi": "(Pronoun) Simi is the hokkien word for “what”. It is used as a reactionary word and also used to ask questions and is often paired with other hokkien words.. Here is a simulated conversation. Ah Lian : “Ah Hua, let me show you my latest fashion statement….ta-da!! My sexy nose ring very nice right!!  Ah Hua: “Simi Sai fashion is this?? (literally: “What kind of  shit fashion is this?”)",
        "Sekali": "(Phrase) Sekali is the malay word for “What if” or “Who knows”.. Here is a simulated conversation. Ah Beng: “I hate my job lah!!! I wanna rage quit!! Ah Seng: Relax lah bro, today got Toto you go and buy a bit sekali you win top prize leh? Then you can seriously consider quitting.\n",
        "Shiok": "(Adjective) Shiok is an exclamation word to describe a feeling of delight due to a positive experience. This experience can be related to good food and also a certain form of relief .. Here is a simulated conversation.  Food: “Wow! This nasi lemak is especially shiok with its sambal chilli. Relief: “After a hot day outside, bathing in cold water is a sibeh shiok experience! […] only added a small dollop of it and it already made me sweat profusely. But, the feeling was darn shiok and it really added a good fiery punch to the […]"
    },
    "t": {
        "Toto": "(Example) Just like 4D which is run by Singapore Pools, Toto is a lottery game and draws take place on Mondays and Thursdays.. Here is a simulated conversation. Toto is a game where the top prize money is high but the odds of winning are extremely low. Punters have to select at least 6 numbers, more numbers can be bought at a higher price.  Ah Lian: “Ah Beng, when are you going to buy me a branded bag huh? Ah Beng: “You wait long long lor, when I struck Toto top prize I will buy you ten pieces. Ah Lian: “That is as good as saying no………..”",
        "Tan Ku Ku": "(Phrase) Tan Ku Ku is a hokkien phrase that in its literal translation means “wait long long” and is often used to tell someone that the chances of what they expect to happen is very remote.. Here is a simulated conversation. Ah Hua: “Ah Lian, I think our class hunk is interested in me leh….he always stealing glances at me and giggle….perhaps he will ask me out soon..\n Ah Lian: “You tan ku ku…….also will not happen..he giggled because I was making funny faces behind your back lah…..",
        "TCSS- Talk Cock Sing Song": "(Example) TCSS which stands for Talk Cock Sing Song is often used by Singaporeans to indicate casual chit chat, to talk trash and anything under the sky.. Here is a simulated conversation. Ah Lian:“Ladies, please come to my place this Saturday for makan and TCSS session!!”\n",
        "TLDR – TL;DR": "(Example) TLDR or TL;DR is basically an acronym for “Too Long; Didn’t Read”. It usually refers to a lengthy post on a forum or a lengthy text message.. Here is a simulated conversation. Ah Lian: “Ah Hua, your message hor…TL;DR……I colouring my nails now….can summarize anot?\n See WOT […] See TLDR […]",
        "Tai Chi": "(Example) Tai Chi is known for its breathing techniques and “Push hand” which is an internal martial art to resist force with force. It is like training the body to take in the attack (force) and redirecting this force back to the aggressor or attacker.. Here is a simulated conversation.  In the singlish world, it can be used for a variety of things most notably at a workplace where everyone is “pushing” their responsibility to others. And others resist, deflect, channel the force back or to another victim and so on. Example 1: Today I wrote an email to my regional manager asking who will be my replacement during my holidays. He directed my email to my local HR, who, in turn direct it to my Team Lead who absolutely has no control over manpower and he in turn redirect back to the regional manager……They were all channeling their internal tai chi powers all over the place.\n Example 2: My superior told me that I had to attend the meeting on his behalf tomorrow, but I managed to tai chi it back to him because I am flying abroad for my holidays tomorrow!!\n",
        "Tumpang, Tompang": "(Phrase) Tumpang/tompang is the malay word for hitching a ride or passing an item to someone who is able to pass on the item to the intended recipient as it is along their way. It can be even used to describe getting someone to help you buy/get things since they are already in the process of doing so.. Here is a simulated conversation. Mohan: “Ah Beng, you riding today? Later can tumpang me to the MRT station anot??   Ah Beng: “Sure, since you going to MRT station, I tumpang my EZlink card to you, you help me top up $10. I need to take public transport next week as I will be sending my motorcycle for servicing."
    },
    "u": {
        "Uplorry": "(Adjective) Uplorry is used to describe someone that had already passed away or an item that is spoilt and no longer can be used.. Here is a simulated conversation. In hokkien, the term “ki chia” means the act of the coffin going up the hearse. Thus, in its English form Up+Lorry became the synonymous word for the hokkien version. Person: “Long time never heard from our old buddy Ah Beng liao, don’t tell me he already uplorry ah??\n Things: “Eh Joe, My television just uplorry, can you recommend me a cheap and good brand as a replacement??",
        "Ulu": "(Adjective) Ulu is commonly used to describe a place that is remote, deserted, abandoned with little human traffic.. Here is a simulated conversation. It is also used for Singapore road names like “Ulu Pandan” and “Jalan Ulu Siglap”. “Darling ah, why did you bring me to such an ulu place for picnic? There is no toilet here and I don’t even see a single human other than us….. “"
    },
    "v": {
        "Van Kleef Aquarium": " This was a place of attraction located in Fort Canning Park between 1950s – 1990s. The aquarium housed various species of marine creatures and was a popular place for school-going children.. Here is a simulated conversation. It was named after a Dutchman by the name of Karl Willem Benjamin Van Kleef who resided in Singapore during the 19th-2oth century. He donated his fortune to the Singapore Government to build the aquarium after his death. The number of visitors dwindled over the years, especially so after the Underwater World opened on Sentosa in the 1990s. It is a pity that the kids nowadays do not know of its once existence. Perhaps, the Van Kleef Aquarium should never have been demolished. The architecture was beautiful and based on its history alone, it should have been preserved as a national monument……."
    },
    "w": {
        "Water Parade": "(Army Lingo) The term Water Parade is something that a Singaporean male will never forget. This is a parade where recruits or trainees need to partake by drinking large amounts of water to prepare them for the upcoming physical training. The purpose is to prevent heat stroke and is a necessary procedure to follow.. Here is a simulated conversation. Sergeant conducting water parade hours before the start of a long route march: “Gentlemen!! This Water Parade is not to tekan you!! It is to prepare you for our long route march. Please remember your chant: “Drink water good, don’t drink water; get heatstroke”\n",
        "Wayang": "(Verb) Wayang is a malay word to describe acting in a performance or a show. However, it is often used to describe someone as being “fake” in the sense he/she is acting, showing theatrics by putting up an act in front of others.. Here is a simulated conversation. After Ah Huay had stolen Al Lian’s Boyfriend and Ah Lian attempted suicide but never die and Ah Huay visits her: Ah Huay: Oh Ah Lian, How are you feeling??? I didn’t mean to cause all this….you can have him back.\n Ah Lian: You don’t wayang lah you!!! Basket!! You come here to see if I already mati is it??? Pui!!",
        "Why you so like that ah??": "(Phrase) “Why you so like that ah?” is a popular singlish phrase to ask someone when they are being difficult, unreasonable or selfish.. Here is a simulated conversation. It is also a very popular local singlish song. The phrase is also commonly misspelled as “why you so liddat ah” and “why you so like dat ah” Ah Beng: Eh Ahmad, today I cannot come and help you at your stall cos my girlfriend asked me out…sorry…\n Ahmad: “Eh Why you so liddat ah?? You promised me one leh!! Now you fly me aeroplane!!!!   ",
        "Women’s Charter": "(Example “ONLY”) Women’s Charter, a legislative act passed in 1961  to protect and advance the rights of women and girls in Singapore.. Here is a simulated conversation. This charter regulates the relationship of a husband and wife. It also regulates the relationship between parents and their children in regard to termination of marriages and division of matrimonial assets. It also serves as a protection against family violence and penalizes those who committed offences against females. Ah Hua: “How??? My husband is divorcing me and he says he will refuse to pay me any alimony…I am not working now…..how am I going to survive??”\n Ah Lian: “Don’t worry, we women got “Women’s Charter” to protect us!!\n Ah Beng: “Of course women no need to worry lah….my guy friend hor, his ex-wife had an affair….then he was so sad and asked for a divorce. His ex-wife then threatened to use the “Women’s Charter” against him and even threatened to say he abused her which he did not….the poor chap is still paying her the monthly alimony…\n \nShare this:Click to share on Facebook (Opens in new window)Click to share on Twitter (Opens in new window)Click to share on Reddit (Opens in new window)Click to share on WhatsApp (Opens in new window)Click to share on Skype (Opens in new window)Click to share on Telegram (Opens in new window)\n\nRelated\n\n",
        "WOLS – Slow": "(Example) WOLS is often used in online forums as well as text messages to tell people that they are slow to realise an event or meaning of things. This often occurs when someone starts a new thread on the forum telling people of a piece of News that most had already knew.. Here is a simulated conversation. Forum Poster A starts new thread: “To commemorate 50 years of National Service, former and current National Servicemen will receive a NS50 Recognition Package comprising a $100 voucher ………”\n Forum Poster B: “Eh…you damn WOLS leh, I already spent the $100 voucher…\n",
        "WOT – Wall of Text": "(Example) WOT is commonly used in forum Posts or in messages when one encounters a long post/message and all they see is literally a wall of text.. Here is a simulated conversation. Ah Beng: “Eh Ah Lian, why you sent me this WOT??? The message so bloody long, can summarize anot??\n See TLDR […] See WOT […]",
        "Womit": " Womit is used as an alternate spelling for vomit as the pronounciation of womit sounds more exaggerated.. Here is a simulated conversation.  Verb:\n “What?? Did you say Ah Lian was very beautiful???? Please lah, don’t make me womit lah.\n",
        "Where Got?": "(Phrase) Where got? is commonly used as a reply to deny the questions or accusations directed by another person. . Here is a simulated conversation. Sometimes the person who used the “where got?” term will be rebuked with a reply: “God in heaven lah” Ah Lian: “Ah Seng, you like Ah Beng’s sister right???\n Ah Seng: Where got?? Don’t have lah….\n Ah Lian: “Where God?? Where God??  God in heaven lah!!\n"
    },
    "x": {
        "Xiao Ming": "(Noun) Xiao Ming (小明) is a common Chinese name in Singapore and is widely used in Chinese School textbook as one of its main character/protagonist.. Here is a simulated conversation. The popular Hokkien name Ah Beng in Chinese is 阿明. Both names are very popular in existence and usage in Singaporeans’ daily lives. Example: “今天小明上了课之后就回家。 (Today, after Xiao Ming had finished his lessons, he went home straight.)\n",
        "Xia Suay": " Xia Suay is often used to describe a person or a situation where there is embarrassment or disgrace caused by the person or actions by that person.. Here is a simulated conversation. Noun:\n Example: “Look at the shabby attire my uncle is wearing for my wedding, he is such a xia suay”\n Example: “Just now I could not control myself and farted in a public bus; everyone looked at me……It was so xia suay for me.”\n"
    },
    "y": {
        "Your Head Ah!": "(Phrase) Your Head Ah is a response to someone’s remark/joke/view/assumption of you that you do not agree with.. Here is a simulated conversation. Ahmad to fellow recruits: Ah Beng is our fittest platoon mate, let’s recommend him to our sergeant for the upcoming Ironman challenge.\n Ah Beng: Your head ah!! Mai Sabo ok???",
        "Yam Seng": "(Exclamation) Yam Seng or Yum Seng means “cheers”. It is a form of congratulatory cheer and usually can be heard at Chinese Weddings.. Here is a simulated conversation. Usually the emcee will lead the way to perform this cheer and the rest of the guests will follow suit. The last cheer will usually be extended by the emcee which adds to the vibrant mood of the wedding dinner.  Emcee at a wedding: “Ladies and Genetlemen, please rise and raise your glasses as we wish our newly wedded couple a blissful marriage. Let’s give then three toasts….Yammmmmm………Seng…….Yammmmmmmm……Seng…….Yammmmmm…..Yamm…Yammm….Yammm….Yammmmmmm…..Seng!! Thank you very much!!” \n",
        "Grandfather’s Road": "(Phrase) Your Grandfather’s road – is used to tell off people when they block the way of others on a public road/place.. Here is a simulated conversation. My Grandfather’s Road – is used to tell people that their grandfather literally own this road. Ah Beng to a well-dressed guy: Eh Champion, can don’t block limpeh from walking this path anot? You think this is Your Grandfather’s Road??\n Well-dressed Guy: Apologies, we are having a celebration to commemorate the memory of my grandfather. This road is named after him and thus it is indeed My Grandfather’s Road. Ah Beng: Paisei Paisei….",
        "Your Coffee Shop Is Open": "(Phrase) Your Coffee Shop Is Open is a phrase used to stealthily inform someone (usually a Male) that they had forgotten to zip their trousers after a visit to the toilet.. Here is a simulated conversation. David: “Wah…just now our new beautiful colleague kept giggling at me when I was chit-chatting with her after my toilet break. She must be smitten by me. Joe: “Of course lah, your coffee shop is open lor…..plus your trousers so baggy your coffee shop open big big in front of her….wait she sue you for sexual harassment.",
        "Yaya": ") Yaya is used to describe an arrogant person, it can also be used to describe someone who is proud and looks down on others.. Here is a simulated conversation. Example: “After Ah Beng won the lottery, he turned from a good natured boy to a yaya person; he stopped greeting me as his uncle.\n Example: “Ahmad became damn yaya after he was promoted to be our Supervisor. Nowadays, he talks to me in a condescending tone.\n",
        "Yaya Papaya": "(Noun) Yaya Papaya is used to described a proud person or a person exhibiting arrogance. Papaya was most likely used to pair with yaya because of their similar pronunciation which makes the term extremely catchy.. Here is a simulated conversation. Example: “That Yaya Papaya walked in just now like he was the biggest spending customer in the universe.”\n Example (a mother to her child after exams have finished): “You Yaya Papaya already lor, exams finished already can relax.” "
    },
    "z": {
        "Zhng": "(Verb) Zhng is commonly used to describe a modification, usually an upgrade to a vehicle or gadget.. Here is a simulated conversation. “Ah Lian, for the sake of you I went to zhng my motorcycle. Now the horsepower very powderful..can go vroom vroom very fast…confirm can beat your best friend’s boyfriend motorcycle.  […] couldn’t raise my arms for much of the time. Anyhoodle, for this pocket of time I decided to zhng my cat photos to get a snazzy new Whatsapp profile […]",
        "Z Monster": " Z Monster is often used to describe a situation where one is fatigued and sleepy.. Here is a simulated conversation. Noun:\n Example:“After studying for the whole night, we found ourselves succumbing to the Z Monster.”"
    }
}