{
    "numeric": {
        "7 Early, 8 Early (七早八早)": "7 Early, 8 Early Origin: Chinese – From the chinese phrase 七早八早, which means early in the morning. “7 Early, 8 Early” (七早八早) also common in its hokkien form is used to refer to the time frame between 7am – 8am (or earlier) when some could still be asleep. It is commonly used as a phrase […]",
        "5Cs": "5Cs Origin: Acronym– 5Cs represents the 5 goals of most Singaporeans: Cash, Credit Card, Condominium, Car, Country Club Membership 5Cs other than representing the 5 goals of most Singaporeans, it is also the criteria that some females would expect from their future husbands. Cash, Credit Card, Condominium, Car and Country Club Membership are the must […]",
        "4D": "4D Origin: Acronym – 4D is a 4 digit lottery 4D is a 4 digit lottery game in Singapore which is run by Singapore Pools. Draws take place on Wednesday, Saturday and Sunday.",
        "13th Month": "13th Month Origin: English – a term for the annual wage supplement (AWS) 13th Month is a term used to refer to the 13th month bonus which is also known as the Annual Wage Supplement (AWS) that “most” companies in Singapore give out to permanent staff. This is also known as year-end bonus.",
        "7th Month": "7th Month Origin: Chinese – The 7th month of the Lunar calendar is a month that celebrates Hungry Ghost Festival. This is a festival observed by Singaporean Chinese. The belief is that spirits will emerge when the gates of the netherworld are opened during this period. The Chinese in Singapore will partake in a series of […]",
        "10KKJ": "10KKJ Origin: Internet slang/Singlish/Hokkien – slang for Tampines, a place situated in the eastern region of Singapore 10KKJ is an internet slang that is used to represent Tampines, a town situated in the eastern region of Singapore. It is not commonly used in conversation but frequently used in online forums, text messages and is usually […]",
        "11B – Military Identification Card": "11B Origin: Army term. 11B is a Military Identification card for Singaporeans serving Full-Time National Service"
    }
}