{
    "numeric": {
        "7 Early, 8 Early (七早八早)": "7 Early, 8 Early Origin: Chinese – From the chinese phrase 七早八早, which means early in the morning. “7 Early, 8 Early” (七早八早) also common in its hokkien form is used to refer to the time frame between 7am – 8am (or earlier) when some could still be asleep. It is commonly used as a phrase […]",
        "5Cs": "5Cs Origin: Acronym– 5Cs represents the 5 goals of most Singaporeans: Cash, Credit Card, Condominium, Car, Country Club Membership 5Cs other than representing the 5 goals of most Singaporeans, it is also the criteria that some females would expect from their future husbands. Cash, Credit Card, Condominium, Car and Country Club Membership are the must […]",
        "4D": "4D Origin: Acronym – 4D is a 4 digit lottery 4D is a 4 digit lottery game in Singapore which is run by Singapore Pools. Draws take place on Wednesday, Saturday and Sunday.",
        "13th Month": "13th Month Origin: English – a term for the annual wage supplement (AWS) 13th Month is a term used to refer to the 13th month bonus which is also known as the Annual Wage Supplement (AWS) that “most” companies in Singapore give out to permanent staff. This is also known as year-end bonus.",
        "7th Month": "7th Month Origin: Chinese – The 7th month of the Lunar calendar is a month that celebrates Hungry Ghost Festival. This is a festival observed by Singaporean Chinese. The belief is that spirits will emerge when the gates of the netherworld are opened during this period. The Chinese in Singapore will partake in a series of […]",
        "10KKJ": "10KKJ Origin: Internet slang/Singlish/Hokkien – slang for Tampines, a place situated in the eastern region of Singapore 10KKJ is an internet slang that is used to represent Tampines, a town situated in the eastern region of Singapore. It is not commonly used in conversation but frequently used in online forums, text messages and is usually […]",
        "11B – Military Identification Card": "11B Origin: Army term. 11B is a Military Identification card for Singaporeans serving Full-Time National Service"
    },
    "a": {
        "Atas": "Atas Origin: Malay – a term to describe a person or some place that is high class Atas can be used to describe someone as being arrogant or snobbish but is more commonly used now to describe someone doing things that is high class and of good taste.",
        "Abang": "Abang Origin: Malay – the term for elder brother and is also informally used to address a malay friend. Abang is a malay term for elder brother or just simply brother. It is common to call a male malay friend “abang” as it is akin to calling him “Hi Bro”.",
        "Ah Huay": "Ah Huay Origin: Hokkien, Ah Huay is the hokkien pronunciation of the chinese name 阿花",
        "Ah Lian": "Ah Lian Origin: Hokkien, Ah Lian is the hokkien pronunciation of the chinese name 阿莲.",
        "Ah Seng": "Ah Seng Origin: Hokkien, Ah Seng is the hokkien pronunciation of the chinese name 阿陈.",
        "agar-agar": "agar-agar Origin: Malay –  a dessert that is similar to jelly. agar-agar is a jelly-like dessert derived from algae. It can also be used as an ingredient to complement other desserts. agar-agar itself can also be added with fruit slices or coconut milk to enhance its taste and appearance.",
        "Alamak": "Alamak Origin: Malay – An exclamation word to express shock or surprise Alamak is an exclamation word used in situations when you are shocked or surprised by something or an event. It is something akin to “Oh my Mother!” and also “Oh my God!”.",
        "Ang Moh": "Ang Moh Origin: Hokkien – It literally means “Red hair” but is used as a term to represent Caucasians Ang Moh is a term that is used to refer to Caucasians. In the past, older people who disliked Caucasians will call them “Ang Moh Gui” (红毛鬼) which literally means “red hair ghost”.",
        "AWARE – Association of Women for Action and Research": "AWARE Origin: Acronym/English – stands for Association of Women for Action and Research AWARE is a non-governmental organization in Singapore that is involved in research and advocacy for women and to promote gender equality.",
        "Agak, Agak-Agak, Agaration": "Agak, Agak-Agak, Agaration Origin: Malay – agak means to estimate Agak and agak-agak are both malay words and are used to describe to estimate/guess. It is a conjecture usually based on one’s experience or one’s estimation."
    },
    "b": {
        "Bao The Mountain, Bao the Sea (Bao Sua Bao Hai,包山包海 )": "Bao The Mountain, Bao the Sea Origin: Hokkien – The chinese-english description of the Hokkien phrase “Bao Sua Bao Hai” “Bao the Mountain , Bao the Sea” (包山包海) is the chinese-english equivalent of the hokkien phrase “Bao Sua Bao Hai”. It literally translates to cover the mountain and cover the sea. It is usually used […]",
        "BGR – Boy Girl Relationship": "BGR – Boy Girl Relationship Origin: Acronym/Abbreviation – stands for Boy Girl Relationship BGR is an acronym for “Boy Girl Relationship”. This is used to describe young couples/teenagers who are in a relationship.",
        "Brudder": "Brudder Origin: Misspell – a popular misspell for the word brother Brudder is a popular misspell for the word brother and is often used in online forums and messages in chat groups.",
        "Buay Tahan": "Buay Tahan Origin: Hokkien/Malay – means unable to withstand/tolerate any longer. Buay (Hokkien) for “cannot” and tahan (malay) for “withstand” combines together to give the expression that one can no longer withstand or tolerate any longer. It has a similar meaning to the malay phrase “tak boleh tahan” where “tak boleh” means cannot.",
        "Botak": "Botak Origin: Malay – a word to describe someone that is bald Botak is used to describe someone that is bald and is also used to describe a balding person. It is also commonly used to describe someone who has just gotten a crew cut, especially new recruits to the Singapore Army. Commonly paired with […]",
        "Blur Like Sotong": "Blur Like Sotong Origin: Singlish – literal translation is as blur as a squid; used for describing a clueless person. Blur Like Sotong is used to describe a person that is totally clueless to the events happening around him/her.",
        "Bo Jio": "Bo Jio Origin: Hokkien/Teochew – a phrase for saying “Why never invite me?” Bo Jio is commonly used to say someone who had left you out on an outing or action.",
        "Bobo Shooter": "Bobo Shooter Origin: Army Lingo/Singlish – a term to describe a person who is unable to aim properly and hit the target. Bobo shooter is used to describe someone that is always off target when it comes to firing a weapon. This term is frequently used in the army where soldiers go for their annual shooting (range) where […]",
        "BTO – Build-To-Order": "BTO Origin: Acronym – BTO stands for Build-To-Order BTO is an acronym that stands for Build-To-Order and this refers to new public housing/flats in Singapore offered by HDB (Housing Development Board of Singapore). BTO sales typically runs quarterly throughout the year. (depends on demand as well)",
        "Borrow Me": "Borrow Me Origin: English/Singlish – broken english phrase used for borrowing something. Borrow me is wrongly used as a phrase when asking someone to lend an item. Instead of asking “Can I borrow your book?” or “Can you lend me your book?” , “borrow me” is often wrongly used in day-to-day conversation."
    },
    "c": {
        "Chicken Feed": "Chicken Feed Origin: Singlish – The term is used to describe a task that is easy to accomplish, just like a piece of cake. Chicken Feed is Singlish’s very own version of the english phrase “a piece of cake”. It is akin to describing that a task is easy or a problem that can be […]",
        "Copycat Kiss The Rat, Go Home Let Your Mother Slap": "Copycat Kiss The Rat, Go Home Let Your Mother Slap Origin: 90s English phrase – Many 90s kids used this phrase to say someone who is basically a copycat. This phrase was popular back in the 90s when school-going kids often used this phrase to spite someone who always copied their actions or to say someone […]",
        "Chao Keng": "Chao Keng Origin: Hokkien- means feigning illness or physical injury Chao Keng is a commonly used term when describing someone for feigning illness or injury in order to avoid a duty/responsibility. This term is often used in the Army and at workplaces. It is synonymous to the english word “malinger”.",
        "Cock-Up": "Cock-Up Origin: English – a common phrase used to describe something bad has occurred Cock-Up is frequently used to described a situation where something bad or unpleasant has occurred and prevent rightful things from happening or causing something bad to happen. E.g. a cock-up that leads to something that was supposed to happen not happening […]",
        "Chi-Ba-Boom": "Chi-Ba-Boom Origin: Singlish – It is a phrase one would say to mimic the sound of an explosion. Chi-Ba-Boom is often used to mimic the sound of an explosion or describe an explosion; often in a comical way.",
        "Calefare": "Calefare Origin: Singlish- a name for someone who is working in a minor role on a film or show. They are commonly refer to as an “Extra” Calefare is someone that takes on a minor role in a film industry. They are usually an extra in a movie or show setting. They could be acting […]",
        "Chin Chai": "Chin Chai Origin: Hokkien/Teochew – literally means “anything” or “whatever” Chin Chai is often used as a reply to a question when one is unable to make up his/her mind or has no preference to a choice. It can also be used to describe a person that is easy-going.",
        "chao private": "Chao Private Origin: Hokkien/English/Army lingo – a name to describe a newly enlisted soldier Chao Private refers to a newly enlisted soldier. The word “chao” stands for smelly in hokkien and Private is the rank for a newly enlisted Soldier. The words used together form a name that is often used on new recruits by […]",
        "Corlick": "Corlick Origin: Singlish/Internet Slang: – a misspell for the word colleague Corlick is often used in internet forums as a misspell for the word colleague as it is phonetically similar.",
        "Chope": "Chope Origin: Singlish – local slang for reserving a table or seat at a hawker centre or eatery with free seating Chope is commonly used in scenarios where one has to reserve a table or seat at a place usually a hawker centre or eatery with no fixed seating. This usually happens when there is […]"
    },
    "d": {
        "Du lan": "Du lan Origin: Hokkien – a Hokkien vulgarity that literally means “poke dick”. This expletive is used to express the pissed-off feeling. Du lan is a very common hokkien expletive that is used to express that one is pissed off with something.",
        "Drop 20": "Drop 20 Origin: Singlish/Army Lingo – a corporal punishment in army in the form of 20 push ups Drop 20 is an army lingo that is used by instructors to give recruits or trainees a corporal punishment of 20 push ups. This punishment is usually meted out if the soldiers failed to follow instructions or […]",
        "Die Die Must Have": "Die Die Must Have Origin: Singlish/English – a phrase that literally says it is a must have even if you have to die for it. The phrase Die Die Must Have is used in scenarios where it is absolutely necessary to have an item or a requirement.",
        "Die Die Must Buy": "Die Die Must Buy Origin: Singlish/English – a phrase that literally says it is a must to buy even if you have to die for it. Die Die Must Buy is a phrase commonly used when a Singaporean spots an absolute bargain or when they travel overseas and realize that goods being sold are much […]",
        "DB – Detention Barracks": "DB – Detention Barracks Origin: Acronym, Army term DB acronym for Detention Barracks is a well-known term among Singaporean males who serve or had served National Service."
    },
    "e": {
        "Eeyur": "Eeyur Origin: Sound – One will produce this sound when you feel disgusted about something Eeyur (eeee…..yurrrrr…) is a sound that one will produce to express that you are disgusted by something that could be gross, dirty or disgusting.",
        "Eye Power": "Eye Power Origin: English/Singlish – used to describe someone that just stares instead of rendering help Eye Power is a phrase frequently used on someone who does not help but just simply stares as though he/she is rendering help through the power of his/her eyes.",
        "Eat Snake": "Eat Snake Origin: Hokkien, literal translation from the hokkien phrase “Jiak Zhua”"
    },
    "f": {
        "Fly Me Aeroplane": "Fly me Aeroplane Origin: Singlish – This phrase is used when someone back out of a promise or a meet-up. Fly me aeroplane, fly aeroplane, fly kite are phrases used when someone back out of a promise or a meet-up.",
        "Fandi Ahmad": "Fandi Ahmad Origin: Person – Famous Singaporean Footballer Fandi Ahmad born in 1962 is a retired Singaporean Footballer who plied his trade mainly in the South-East Asia region between late 1970s – 1990s . He also featured for FC Groningen of Netherlands in 1983, famously scoring a goal against Walter Zenga in a UEFA Cup tie […]"
    },
    "g": {
        "Goondu": "Goondu Origin: Tamil/Malay – literally means fat (tamil) and hard (malay) but is used locally to describe a stupid person or an idiot. Goondu is a name that you use on someone who is either stupid or someone that acts like an idiot.",
        "GG – Good Game": "GG – Good Game Origin: Acronym / Internet Slang – Usually used for saying it was a good game after the end of a online game/match GG is often used to tell one another at the end of the game or match that it was a good game. However, it is also used to describe […]",
        "Grandfather’s Road": "Your/My Grandfather’s Road Origin: Singlish/English- usually used to tell off someone when they block others from accessing a place/road. Your Grandfather’s road – is used to tell off people when they block the way of others on a public road/place. My Grandfather’s Road – is used to tell people that their grandfather literally own this […]",
        "Gao Gao": "Gao Gao Origin: Hokkien – gao means thick, gao gao means very thick Gao Gao are two words with the same meaning of thick and when used together represents it as extra thick or concentrated depending on what the usage is for.",
        "Garang": "Garang Origin: Malay/army lingo – it means fierce Garang means fierce or when used in army lingo literally means gung-ho.",
        "Gostan": "Gostan Origin: Malay – it means reverse and is a contradiction of the nautical term “to go astern” Gostan is used in scenarios where you need someone to go reverse/backwards. This usually happens in driving situations when you overshot at a destination or turn.",
        "Gila": "Gila Origin: Malay, the malay word for the english equivalent of crazy"
    },
    "h": {
        "Han Plang": "Han Plang Origin: Singlish – This term means literally everything. Han Plang is used to describe putting everything together or just simply everything.",
        "Ho Seh Boh??": "Ho Seh Boh? Origin: Hokkien – It is a question asking “How have you been?” A popular hokkien greeting when you chance upon a friend outside. It is a simple and yet effective greeting that asks the person how has he/she been.",
        "Horrigible": "Horrigible Origin: Singlish/Misspell – It is a misspell of horrible and could also mean a combination of both horrible and incorrigible Horrigible is sometimes used to describe both a horrible and incorrigible person.",
        "Hao Lian": "Hao Lian Origin: Teochew – a term to describe a person as a show-off Hao Lian is used to describe a person as boastful or a show-off. A Hao Lian is a kind of person that likes to flaunt his/her wealth or success to friends and relatives.",
        "Hor Jiak Hor Koon": "Hor Jiak Hor Koon Origin: Hokkien – literal transalation “good to eat and good to sleep” Hor Jiak Hor Koon is a hokkien term to describe someone having a good life with no worries.",
        "Hokkien Peng – Hokkien Soldier": "Hokkien Peng Origin: Hokkien/army lingo – Hokkien speaking soldiers of the Singapore Army “Hokkien Peng” refers to hokkien speaking soldiers of the early Singapore Army. This term usually refers to soldiers in the past when most spoke hokkien instead of english due to a lack of education.",
        "Heng": "Heng Origin: Hokkien – it means fortunately or luckily Heng is used to express some event that you are lucky or fortunate to encounter or to avoid.",
        "HDB – Housing Development Board": "HDB Origin: Acronym, HDB stands for Housing Development Board"
    },
    "i": {
        "ICT – In-Camp Training": "ICT Origin: Acronym/Army Lingo – ICT stands for In-Camp Training ICT stands for In-Camp Training for active Singaporean National Servicemen. It is usually a once or twice a year event to refresh the skills of active National Servicemen as well as getting them up to date with defence news,etc."
    },
    "j": {
        "Jiak": "Jiak Origin: Hokkien/Teochew – literal translation “to eat” Jiak is a commonly used word to ask people if they have already eaten or to invite them to eat. It can be used to greet one another at the dinner table urging them to start eating. Younger family members will also greet their seniors at the […]",
        "Jialat": "Jialat Origin: Hokkien and Teochew, Jia Lat literally means to eat away (to drain away) the strength."
    },
    "k": {
        "Karung Guni": "Karung Guni Origin: Malay – It means gunny sack but is more popular as a reference to our local Rag-and-Bone Man. Karung Guni better known to Singaporeans as Karung Guni Man is our local Rag-And-Bone Man who collects old items like newspaper, electrical appliances, clothes and many other stuff. In the past, they will go […]",
        "KPKB – Kao Peh Kao Bu": "KPKB – Kao Peh Kao Bu Origin: Acronym/Hokkien – Literally means “Cry Father, Cry Mother” in hokkien. This hokkien phrase is used to describe someone who cry/bawl when their father/mother passed away. However, it is used popularly to describe someone who makes a lot of noise (usually making a complaint). This is especially true when […]",
        "Kampong Spirit": "Kampong Spirit Origin: Malay- Kampong in malay means a rural village and the term kampong spirit means neighbours in the same village are helpful to one another thus creating this kampong spirit. The term Kampong / Kampung Spirit is also often used in Singapore’s urban concrete jungle (HDB) where neighbours live in the same estate […]",
        "Kilat": "Kilat Origin: Malay/Army Lingo – Literally means excellent in malay. Kilat is a malay word that is often used in the Army. It is used to describe something that is done in such an excellent way and is hard for others to follow.",
        "Referee Kayu": "Referee Kayu Origin: Malay- Kayu literally means wood in malay and Referee Kayu is used as a chant to scold referees when they made incorrect decisions. Referee Kayu could be often heard when one watches a live football match at a stadium. This often occurs when the referee made an incorrect or odd decision. Referee […]",
        "Kena": "Kena Origin: Malay – To be at the receiving end/suffering of something unpleasant Kena is a malay word to describe someone that is on the receiving end of something unpleasant and it can also mean the person is suffering or afflicted from something. It is often paired with the hokkien term “sai” (shit). So, you will […]",
        "Kakak": "Kakak Origin: Malay – malay word for older sister Kakak is the malay word for older sister. It can be used to call an elder female sibling or an older female friend.",
        "Kaki": "Kaki Origin: Malay- Kaki stands for “leg” but is more commonly used to refer a person as a close friend or buddy. Kaki is used to describe a close friend or a buddy.",
        "Kan Cheong": "Kan Cheong Origin: Hokkien, literally means nervous"
    },
    "l": {
        "Legit": "Legit Origin: English/Millennial language – it means real and not fake. Legit is commonly used by the millennials to refer to something as real and not fake.",
        "Liddat": "Liddat Origin: Singlish/internet slang- misspell for “like that” Liddat is a misspell for “Like that” and is usually used as a short form in text messages as well as in online forums.",
        "Lepak": "Lepak Origin: Malay – It means to relax, hang out or chill out by doing nothing. Lepak is used to describe chilling out, to relax at a place or home by not doing anything. It is a form of enjoyment that is carefree and stress-free.",
        "Lagi": "Lagi Origin: Malay – lt simply means more, greater, further. Lagi is the Malay word that is used to describe something that is more or greater than usual which can be for the better or for worse.",
        "Look-See": "Look-See Origin: English/Singlish – means to check or examine. Look-See is used to express to check or examine and sometimes just simply means to have a look.",
        "Lobang": "Lobang Origin: Malay, literally means a gap, hole or an opening but is being used more often to describe an opportunity"
    },
    "m": {
        "MLMLWML – Mai Lai, Mai Lai, Wa Mai Lai": "MLMLWML – Mai Lai, Mai Lai, Wa Mai Lai Origin: Acronym/Internet Slang/Hokkien – Literally means “don’t want, don’t want, I don’t want!” This hokkien phrase is used popularly as an acronym in online forums. It is mainly used in reply to an undesirable suggestion telling people that they really do not want it or to […]",
        "Grandfather’s Road": "Your/My Grandfather’s Road Origin: Singlish/English- usually used to tell off someone when they block others from accessing a place/road. Your Grandfather’s road – is used to tell off people when they block the way of others on a public road/place. My Grandfather’s Road – is used to tell people that their grandfather literally own this […]",
        "MC – Medical Certificate": "MC – Medical Certificate Origin: Acronym/Abbreviation – MC stands for Medical Certificate MC is always used as an abbreviation for Medical Certificate.",
        "Macam": "Macam Origin: Malay – means like, similar to or a resemblance of something. Macam is a malay word to describe something that is like or similar or bear resemblance to another thing.",
        "Makan": "Makan Origin: Malay – literal translation “to eat” Makan is a very commonly used word in Singapore. It is used to ask people if they have eaten or to invite them to eat. It is similar to the hokkien/teochew dialect word “jiak“.",
        "MR – Mindef Reserve": "MR Origin: Acronym, Army lingo – MR is the acronym for Mindef Reserve",
        "Malu": "Malu Origin: Malay – It means to be embarrassed Malu is used to describe a feeling of embarrassment due to an act by the person himself/herself or by others.",
        "MINDEF": "MINDEF Origin: Abbreviation for Ministry of Defence MINDEF is the short form for the Ministry of Defence. This is a ministry of the Singapore Government that is in charge of national defence. It is the headquarters of the SAF – Singapore Armed Forces. Total Defence is its policy and consists of five pillars namely Military […]",
        "mum mum": "mum mum Origin: Singlish , baby lingo. “mum mum” means food"
    },
    "n": {
        "Ngeow": "Ngeow Origin: Hokkien/Teochew – The direct translation is “Cat” but is mostly used to describe a scrooge. Ngeow is used to described a person that is stingy and behaves like a scrooge. A person of such personality can also be picky over trivial things and find fault with others.",
        "NATO – No Action Talk Only": "NATO Origin: Acronym, Army lingo.",
        "NRIC – National Registration Identity Card": "NRIC Origin: Acronym, NRIC stands for National Registration Identity Card."
    },
    "o": {
        "Oei": "Oei Origin: Singlish/Sound- Used when calling out to someone (informal) Oei or Oui is used when you call out to someone that you know. It is an informal way and some regard it as a being rude especially when you are the one being called out to.",
        "O$P$ – Owe Money, Pay Money": "O$P$ – Owe Money, Pay Money Origin: Acronym/English – O$P$ is a short form for Owe Money , Pay Money The acronym O$P$ is often seen scribbled/sprayed on walls of buildings where the debtor lives. This is a tactic employed by loan sharks who harass debtors who failed to pay up. O$P$ + unit no. […]",
        "OTOT – Own Time, Own Target": "OTOT – Own Time, Own Target Origin: English/Singlish/Army Lingo – Acronym for “Own Time, Own Target” OTOT which stands for “Own Time, Own Target” is a phrase first used in Army Camps when conducting shooting practice at a range for the soldiers. Instructions will be given to soldiers in this manner: “Firers watch the front, […]",
        "Old Bird": "Old Bird Origin: Singlish/Hokkien – the english translation of “Lao Jiao” in hokkien means someone who is experienced and is considered to be a senior at a workplace. Old Bird is used to describe someone who has been at a e.g. a workplace or army for years and is considered to be experienced and a […]",
        "ORD – Operationally Ready Date": "ORD Origin: Acronym, Army term. ORD stands for Operationally Ready Date."
    },
    "p": {
        "Pong Pong": "Pong Pong Origin: Baby Lingo / Singlish  – means to take a bath Pong Pong is a baby lingo that represents the act of taking a bath.",
        "Pasar Malam": "Pasar Malam Origin: Malay – it means Night market/bazaar. Pasar Malam is a common sight in the heartlands estates in Singapore. Not necessarily just restricted to the night, it can be operational during the day; but at night will see its peak. This is like a bazaar/pop-up stalls where one can find street food as […]",
        "Powderful": "Powderful Origin: Singlish – This is a misspelling/pun of the word powerful. Powderful is often used as a pun to sarcastically praise someone of his/her qualities.",
        "Paiseh": "Paiseh Origin: Hokkien – Hokkien for feeling embarrassed, shy or having a sense of shame. Paiseh is a commonly used hokkien word to describe one’s embarrassment in a situation.",
        "Ponteng": "Ponteng Origin: Malay, a term to describe a person’s deliberate absence from an event, truancy by skipping school, work, etc. Ponteng is a malay word to describe skipping an event, especially used for truancy in which the malay phrase “ponteng sekolah” means “skipping school”."
    },
    "q": {
        "Queenstown (Singapore)": "Queenstown Origin: Places – Queenstown is the first satellite town in Singapore. Queenstown located in the south-western part of Singapore’s central region is the first satellite town in Singapore. It was first developed by Singapore Improvement Trust in the 1950s and thereafter by HDB in the 1960s."
    },
    "r": {
        "Referee Kayu": "Referee Kayu Origin: Malay- Kayu literally means wood in malay and Referee Kayu is used as a chant to scold referees when they made incorrect decisions. Referee Kayu could be often heard when one watches a live football match at a stadium. This often occurs when the referee made an incorrect or odd decision. Referee […]",
        "ROM – Registry Of Marriages": "ROM Origin: Acronym/English – ROM stands for Registry of Marriages ROM is the acronym for Registry of Marriages, this is the place where couple tie their knot formally as a civil marriage in Singapore.",
        "Reservist": "Reservist Origin: English, Army Lingo – An annual event where Singaporean NSmen go back to the Army or service force for In-Camp Training. Reservist in english refers to a person who is a member of their country’s military reserve force. In Singapore, it is largely used to describe In-Camp Training for Singaporean NSmen."
    },
    "s": {
        "Siang Kar Pager?": "Siang Kar Pager? Origin: Hokkien – It is a question asking who had paged me on my pager This hokkien phrase was commonly used back in the 80s/90s and early 2000s when there was widespread use of pagers. A pager also known as a beeper is a telecommunication device that can receive alphanumeric messages and […]",
        "Satki": "Satki Origin: Hokkien/Chinese – literally means someone has a fierce aura/look (杀气). Satki is used to describe someone that has a fierce aura/look. However, It is popularly used to describe someone that looks cool. It is as though if looks could kill.",
        "Sayang": "Sayang Origin: Malay- could either mean love, calling someone that is dear to you and can also be used to describe “what a pity”. Sayang can be used in various forms. It can be used to tell someone that you love or dote on them, or to call out to someone that is dear to […]",
        "Sedap": "Sedap Origin: Malay- Literally means tasty, delicious or yummy Sedap is a malay word used to describe food as being tasty, delicious or yummy.",
        "shee shee": "shee shee Origin: Baby Lingo – shee shee stands for the act of passing urine.  The phrase shee shee is usually used on toddlers. It is used to ask the toddlers if they want to urinate. The continuous whistling “shee” sound with a short interval pause is used to urge the toddler to urinate.",
        "SBC": "SBC Origin: Acronym for Singapore Broadcasting Corporation SBC is the acronym for Singapore Broadcasting Corporation which was active between 1980-1994 bringing quality drama, documentaries and current affairs programmes to Singapore’s viewers.",
        "Salah": "Salah Origin: Malay – Malay word for wrong, incorrect. Salah is the malay word to inform that a person or something is wrong or incorrect.",
        "Simi": "Simi Origin: Hokkien – Hokkien for “What” Simi is the hokkien word for “what”. It is used as a reactionary word and also used to ask questions and is often paired with other hokkien words.",
        "Sekali": "Sekali Origin: Malay – Malay word for “What if” Sekali is the malay word for “What if” or “Who knows”.",
        "Shiok": "Shiok Origin: Malay – An exclamation word to describe a feeling of delight  Shiok is an exclamation word to describe a feeling of delight due to a positive experience. This experience can be related to good food and also a certain form of relief ."
    },
    "t": {
        "Toto": "Toto Origin: English– a type of lottery game in Singapore Just like 4D which is run by Singapore Pools, Toto is a lottery game and draws take place on Mondays and Thursdays. Toto is a game where the top prize money is high but the odds of winning are extremely low. Punters have to select […]",
        "Tan Ku Ku": "Tan Ku Ku Origin: Hokkien – a phrase that literal says “wait long long” Tan Ku Ku is a hokkien phrase that in its literal translation means “wait long long” and is often used to tell someone that the chances of what they expect to happen is very remote.",
        "TCSS- Talk Cock Sing Song": "TCSS Origin: Acronym/Singlish/English – TCSS stands for Talk Cock Sing Song TCSS which stands for Talk Cock Sing Song is often used by Singaporeans to indicate casual chit chat, to talk trash and anything under the sky.",
        "TLDR – TL;DR": "TLDR Origin: Acronym/Internet Slang – stands for “Too Long; Didn’t Read” TLDR or TL;DR is basically an acronym for “Too Long; Didn’t Read”. It usually refers to a lengthy post on a forum or a lengthy text message.",
        "Tai Chi": "Tai Chi Origin: Chinese, Tai Chi  is the abbreviation for the Chinese Martial Art 太极拳 (Tai Chi Quan) Tai Chi is known for its breathing techniques and “Push hand” which is an internal martial art to resist force with force. It is like training the body to take in the attack (force) and redirecting this […]",
        "Tumpang, Tompang": "Tumpang/Tompang Origin: Malay – Malay word for hitching a ride. Tumpang/tompang is the malay word for hitching a ride or passing an item to someone who is able to pass on the item to the intended recipient as it is along their way. It can be even used to describe getting someone to help you […]"
    },
    "u": {
        "Uplorry": "Uplorry Origin: Singlish/English/Hokkien – to describe a particular person has died/passed away and also can be used to describe things beyond repair. Uplorry is used to describe someone that had already passed away or an item that is spoilt and no longer can be used. In hokkien, the term “ki chia” means the act of the […]",
        "Ulu": "Ulu Origin: Malay, to describe a place that is remote or deserted. Ulu is commonly used to describe a place that is remote, deserted, abandoned with little human traffic."
    },
    "v": {
        "Van Kleef Aquarium": "Van Kleef Aquarium Origin: Van Kleef Aquarium was an Aquarium built in 1950s and was subsequently demolished in 1990s"
    },
    "w": {
        "Water Parade": "Water Parade Origin: Army Lingo – A parade where recruits have to drink large amounts of water. The term Water Parade is something that a Singaporean male will never forget. This is a parade where recruits or trainees need to partake by drinking large amounts of water to prepare them for the upcoming physical training. The […]",
        "Wayang": "Wayang Origin: Malay- Literally means acting Wayang is a malay word to describe acting in a performance or a show. However, it is often used to describe someone as being “fake” in the sense he/she is acting, showing theatrics by putting up an act in front of others.",
        "Why you so like that ah??": "Why you so like that ah?? Origin: Singlish/English – This phrase is used to question someone when they are being unreasonable, difficult or selfish “Why you so like that ah?” is a popular singlish phrase to ask someone when they are being difficult, unreasonable or selfish. It is also a very popular local singlish song. […]",
        "Women’s Charter": "Women’s Charter Origin: English – a legislative act to protect the rights of women and girls in Singapore Women’s Charter, a legislative act passed in 1961  to protect and advance the rights of women and girls in Singapore.",
        "WOLS – Slow": "WOLS Origin: Internet Slang – Slow spelled in reverse WOLS is often used in online forums as well as text messages to tell people that they are slow to realise an event or meaning of things. This often occurs when someone starts a new thread on the forum telling people of a piece of News […]",
        "WOT – Wall of Text": "WOT Origin: Acronym/Internet Slang – WOT stands for “Wall Of Text” WOT is commonly used in forum Posts or in messages when one encounters a long post/message and all they see is literally a wall of text.",
        "Womit": "Womit Origin: Singlish, used as an alternative to the english word vomit. Womit is used as an alternate spelling for vomit as the pronounciation of womit sounds more exaggerated.",
        "Where Got?": "Where got? Origin: Singlish, Where got? is used as a reply, usually a denial to a question. Where got? is commonly used as a reply to deny the questions or accusations directed by another person."
    },
    "x": {
        "Xiao Ming": "Xiao Ming (小明) Origin: Chinese – the most common Chinese name used in Singapore Chinese school text book Xiao Ming (小明) is a common Chinese name in Singapore and is widely used in Chinese School textbook as one of its main character/protagonist.",
        "Xia Suay": "Xia Suay Origin: Hokkien and Teochew – a term to describe embarrassment or disgrace. Xia Suay is often used to describe a person or a situation where there is embarrassment or disgrace caused by the person or actions by that person."
    },
    "y": {
        "Your Head Ah!": "Your Head Ah! Origin: English / Singlish – An exclamation response/curse to someone’s remark Your Head Ah is a response to someone’s remark/joke/view/assumption of you that you do not agree with.",
        "Yam Seng": "Yam Seng Origin: Cantonese – It means “Cheers” Yam Seng or Yum Seng means “cheers”. It is a form of congratulatory cheer and usually can be heard at Chinese Weddings. Usually the emcee will lead the way to perform this cheer and the rest of the guests will follow suit. The last cheer will usually […]",
        "Grandfather’s Road": "Your/My Grandfather’s Road Origin: Singlish/English- usually used to tell off someone when they block others from accessing a place/road. Your Grandfather’s road – is used to tell off people when they block the way of others on a public road/place. My Grandfather’s Road – is used to tell people that their grandfather literally own this […]",
        "Your Coffee Shop Is Open": "Your Coffee Shop Is Open Origin: Singlish – a phrase to tell someone that their fly is unzipped. Your Coffee Shop Is Open is a phrase used to stealthily inform someone (usually a Male) that they had forgotten to zip their trousers after a visit to the toilet.",
        "Yaya": "Yaya Origin: Malay, to describe an arrogant person Yaya is used to describe an arrogant person, it can also be used to describe someone who is proud and looks down on others.",
        "Yaya Papaya": "Yaya Papaya Origin: Malay and Singlish – This term is derived from the malay word “yaya” which is to describe an arrogant person. Yaya Papaya is used to described a proud person or a person exhibiting arrogance. Papaya was most likely used to pair with yaya because of their similar pronunciation which makes the term […]"
    },
    "z": {
        "Zhng": "Zhng Origin: Hokkien – A word to describe modify/upgrade Zhng is commonly used to describe a modification, usually an upgrade to a vehicle or gadget.",
        "Z Monster": "Z Monster Origin: Singlish, a term used to describe sleepiness, drowsiness or fatigue Z Monster is often used to describe a situation where one is fatigued and sleepy."
    }
}